const { emojis, discord } = require("../config");

module.exports = {

    locale: "bg_BG",

    utils: {
        prefix: (prefix) => `Моят текущ префикс е \`${prefix}\`\nИзползвайте \`${prefix}help\` за повече информация.`,
        viewConf: () => `[Преглед на конфигурацията в контролния панел](https://invite-count.xyz)`,
        conf: {
            title: () => `Преглед на конфигурацията в контролния панел`,
            content: () => `[или в контролния панел](https://invite-count.xyz)`
        },
        specialMessages: {
            join: {
                oauth2: (user) => `${user} се присъедини към сървъра чрез OAuth.`,
                
                vanity: (user) => `${user} се присъедини към сървъра чрез discord.gg покана, зададена от собственика на сървъра.`,
                unknown: (user) => `Не мога да разбера как ${user} се присъедини към сървъра.`,
                perm: (user) => `${emojis.error} | Нуждаях се от разрешения за управление на сървъра, за да знам кой е поканил ${user}.`
            },
            leave: {
                oauth2: (user) => `${user} напусна сървъра, се присъедини чрез OAuth.`,
                vanity: (user) => `${user} напусна сървъра, се присъедини чрез discord.gg покана, зададена от собственика на сървъра.`,
                unknown: (user) => `${user} напусна сървъра, но не мога да разбера как се присъедини.`
            }
        }
    },

    errors: {
        missingPerms: (neededPermissions) => `__**${emojis.error} Липсват разрешения**__\n\nНуждаям се от следните разрешения, за да работи правилно тази команда: ${neededPermissions.map((p) => "`"+p+"`").join(", ")}`,
        disabled: () => `${emojis.error} | Тази команда е в момента деактивирана!`,
        permLevel: (name) => `${emojis.error} | Тази команда изисква ниво на разрешения: \`${name}\`!`,
        sendPerm: () => `${emojis.error} | Нямам разрешение да изпращам съобщения на този канал.`,
        missingAdmin: () => `${emojis.error} | Нуждаям се от разрешението \`Управление на сървъра\` за извършване на това действие`
    },
    glogs: {
        err: () => `<:error:851490719934840872> | Текущият канал е вече този канал!`,
        success: () => `<:succes:851491428563812382> | Каналът на дневника е успешно зададен.`
    },
    glist: {
        title: () => `🎁 Списък на раздаванията`,
        description: (prefix) => `Използвайте \`${prefix}gstart\` за да започнете раздаване. Показани са само незавършени раздавания`,
        fields: {
            name: () => `> Списък`,
            message: (gs) => `${gs.map(ginfos=>`<:channel:851482936787730472> [${ginfos.prize}](${ginfos.messageURL}) : Завършва ${ginfos.endAt}`).join("\n")} `
        },
        err: () => `<:error:851490719934840872> | На този сървър няма незавършени раздавания`,

    },
    help: {
        title: () => `ℹ Страница за помощ на InviteCount`,
        description: (guildName, prefix) => `InviteCount ви позволява да управлявате членовете на сървъра чрез проследяване на поканите.\n\n**Документацията** е достъпна [тук](https://docs.invite-count.xyz/).`,
        moderation: {
            title: () => `🛡️ **Модерирането**`,
            content: (prefix) => "> `ban`, `kick`, `unban`"},
        admin: {
            title: () => `⚙️ **Администрация**`,
            content: (prefix) => "> `addbonus`, `removebonus`, `sync-invites`, `removeinvites`, `restoreinvites`, `setprefix`, `setlang`, `config`"},
        joinDM: {
            title: () => `💻 **Общо**`,
            content: (prefix) => "> `infos`, `add`, `membercount`, `userinfo`, `support`, `credits`, `invites`, `leaderboard`"},
        join: {
            title: () => `:tools: **Конфигурация**`,
            content: (prefix) => "> `configjoin`, `setjoin`, `testjoin`, `configleave`, `setleave`, `testleave`, `configdm`, `setdm`, `testdm`"},
        leave: {
            title: () => `:envelope: Съобщения за напускане`,
            content: (prefix) => "`configleave`, `setleave`, `testleave`"},
        giveaway: {
            title: () => `🎁 **Раздавания**`,
            content: (prefix) => "> `gstart`, `gend`, `glist`, `glogs`, `greroll`"},
        invites: {
            title: () => `:wave: Поканите`,
            content: (prefix) => "`invite`, `leaderboard`"},
        manageInvite: {
            title: () => `💠 Инструменти`,
            content: (prefix) => "`membercount`, `userinfo`, `botinfos`, `ping`, `creators`, `support`, `credits`, `add`"},
        tip: (prefix) => `🔗 Линкове :`,
        links: (clientID) => `[Добавете ме](https://discordapp.com/api/oauth2/authorize?client_id=${clientID}&permissions=8&scope=bot) ● [Уебсайт](https://invite-count.xyz) ● [Сървър за поддръжка](${discord}) ● [Гласувайте за мен](https://discord.boats/bot/${clientID}/vote)`
    },

    infos: {
        title: () => `**InviteCount**`,
        content: () => `InviteCount ви позволява да управлявате членовете на сървъра чрез проследяване на поканите.`,

        dev: {
            title: () => `**Информация**`,
            content: (uptime) => `<:arrow:766358167382523944> **Разработчици:** Npg, Alex, Alboom\n <:arrow:766358167382523944> **Библиотека:** [discord.js v14.14.1](https://discord.js.org/#/)\n <:arrow:766358167382523944> **Време на работа** ${uptime}\n <:arrow:766358167382523944> **Дата на създаване:** 12 май 2019 г.`
        },
        statistics: {
            title: () => `**Статистика**`,
            content: (guilds, users, channels, ping, ram, shardID) => `<:arrow:766358167382523944> **Сървъри:** ${guilds}\n<:arrow:766358167382523944> **Потребители**: ${channels}\n<:arrow:766358167382523944> **Канали:** ${users}`
        },
        link: {
            title: () => `**Линкове**`,
            content: () => `<:arrow:766358167382523944> **Сървър за поддръжка:** [Щракнете](${discord})\n<:arrow:766358167382523944> **Покана:** [Щракнете](https://discordapp.com/api/oauth2/authorize?client_id=577236734245470228&permissions=8&scope=bot)`
        }
    },

    credits: {
        title: () => `**InviteCount**`,
        content: () => `InviteCount ви позволява да управлявате членовете на сървъра чрез проследяване на поканите.`,

        dev: {
            title: () => `**Разработчици :**`,
            content: (uptime) => `[Npg](https://github.com/ThisDudeBoy)\n[Alex](https://discord.com)\n[Alboom](https://discord.com)`
        },
        statistics: {
            title: () => `**Вдъхновено от :**`,
            content: (guilds, users, channels, ping, ram, shardID) => `[ManageInvite](https://github.com/ManageInvite/ManageInvite)\n[InviteManager](https://github.com/SideProjectGuys/invite-manager-bot)`
        },
        link: {
            title: () => `**Специална благодарност :**`,
            content: () => `⭐ **Androz** за помощта с ManageInvite!\n🎁 **Pauldb09** за системата на раздаването\n👨‍🏭 Целия екип & Преводачи`
        }
    },

    invite: {
        description: (member, memberData, isYou, nextRank, role) => `${isYou ? `Имате` : `**${member.user.username}** има`} **${memberData.invites + memberData.bonus - memberData.leaves - memberData.fake}** поканите! (**${memberData.invites}** нормални, **${memberData.bonus}** бонус, **${memberData.fake > 0 ? `-${memberData.fake}` : `${memberData.fake}`}** фалшиви, **${memberData.leaves > 0 ? `-${memberData.leaves}` : `${memberData.leaves}`}** напускания)${nextRank ? `\nНуждаете се от **${Math.round(nextRank.inviteCount - (memberData.invites + memberData.bonus - memberData.leaves - memberData.fake))}** повече поканите, за да достигнете следния ранг: **${role}**!` : ""}`
    },

    inviter: {
        description: (member, inviterName) => `**${member.user.username}** was invited by **${inviterName}**`,
        unknown: () => `Unknown`,
        notFound: () => `Inviter not found (user may have been deleted)`
    },
    leaderboard: {
        cleared: () => `${emojis.success} | Класирана списък е изтрит!`,
        user: (user, member, lb) => `${lb} **${user.username}** - **${member.calculatedInvites}** поканите (**${member.invites}** нормални, **${member.bonus}** бонус, **${member.fake > 0 ? `-${member.fake}` : `${member.fake}`}** фалшиви, **${member.leaves > 0 ? `-${member.leaves}` : `${member.leaves}`}** напускания)`,
        prompt: () => `{{user}}, на коя страница искате да отидете? Напишете \`cancel\` или \`0\` за отмяна.`,
        title: () => `Класиране на поканите`,
        empty: {
            title: () => `😕 Поканите не са намерени`,
            content: () => `Начнете да каните хора и ще се появите на тази страница!`
        }
    },

    userinfo: {
        title: (user) => `${user.tag} профил (${user.id})`,
        fields: {
            createdAt: {
                title: () => `<:createdAt:741247823269593118> Създаване`
            },
            bot: {
                title: () => `<:maestro_robot:749985600110723184> Bot`,
                content: (user) => user.bot ? "Да" : "Не"
            },
            joinedAt: {
                title: () => `<:join:741252065585660014> Присъединен`
            },
            joinWay: {
                title: () => `Начин на присъединяване`,
                oauth: () => `OAuth покана (чрез discordapp.com).`,
                vanity: () => `Персонализирана покана, зададена от администратор.`,
                unknown: (user) => `Не мога да разбера как потребителят ${user.username} се присъедини към сървъра.`,
                invite: (user) => user.tag
            },
            invites: {
                title: () => `✉️ Поканите`,
                content: (inviteData) => `**${inviteData.invites + inviteData.bonus - inviteData.leaves - inviteData.fake}** поканите (**${inviteData.invites}** нормални, **${inviteData.bonus}** бонус, **${inviteData.fake > 0 ? `-${inviteData.fake}` : `${inviteData.fake}`}** фалшиви, **${inviteData.leaves > 0 ? `-${inviteData.leaves}` : `${inviteData.leaves}`}** напускания)`
            },
            joinOrder: {
                title: () => `➡️ Ред на присъединяване`,
                content: (previous, next, user) => `${previous ? `**${previous.tag}** > ` : ""}**${user.tag}**${next ? ` > **${next.tag}**` : ""}`
            }
        }
    },

    kick: {
        errors:{
            missingPerms: "<:error:753232040199192657> | Трябва да имате разрешение `KICK_MEMBERS`",
            nouser: "<:error:753232040199192657> | Моля, спомнете потребител",
            supperior: "<:error:753232040199192657> | Не можете да изхвърлите потребител, който е над вас",
            noperm: "<:error:753232040199192657> | Възникна грешка... Моля, проверете дали имам разрешение да изхвърля този член и опитайте отново!",
            
        },
        description: "<:success:753232040073101363> | Потребителят е изхвърлен.",
        banneddm: (server, moderator, reason) => "Бяхте изхвърлени от **" + server + "** от **" + moderator + "**\n**Причина** : `" + reason + "`" 
    },

    ban: {
        errors:{
            missingPerms: "<:error:753232040199192657> | Трябва да имате разрешение `BAN_MEMBERS`",
            nouser: "<:error:753232040199192657> | Моля, спомнете потребител",
            supperior: "<:error:753232040199192657> | Не можете да забраните потребител, който е над вас",
            noperm: "<:error:753232040199192657> | Възникна грешка... Моля, проверете дали имам разрешение да забранявам този член и опитайте отново!",
            
        },
        description: "<:success:753232040073101363> | Потребителят е забранен.",
        banneddm: (server, moderator, reason) => "Бяхте забранени на **" + server + "** от **" + moderator + "**\n**Причина** : `" + reason + "`" 
    },

    unban: {
        noid: "<:error:753232040199192657> | Моля, дайте ID за отбиване на забраната",
        success: (user) => "<:success:753232040073101363> | " + user + " успешно е отбанван",
        noban: "<:error:753232040199192657> | Този потребител не е забранен"
    },

    membercount: {
        title: (guildName) => `Брой членове ${guildName}`,
        description: (guild) => `
        Общо **${guild.members.cache.size}** членове (**${guild.members.cache.filter((m) => !m.user.bot).size}** хора и **${guild.members.cache.filter((m) => m.user.bot).size}** ботове)

        ➔ ${emojis.dnd} | ${guild.members.cache.filter((m) => m.presence.status === "dnd"  && !m.user.bot).size} членове (не безпокой)
        ➔ ${emojis.online} | ${guild.members.cache.filter((m) => m.presence.status === "online" && !m.user.bot).size} членове (активна)
        ➔ ${emojis.idle} | ${guild.members.cache.filter((m) => m.presence.status === "idle" && !m.user.bot).size} членове (неактивна)
        ➔ ${emojis.offline} | ${guild.members.cache.filter((m) => m.presence.status === "offline" && !m.user.bot).size} членове (офлайн)`
    },

    addbonus: {
        errors: {
            bonus: {
                missing: (prefix) => `${emojis.error} | Трябва да посочите броя на бонус поканите за добавяне. (Синтаксис: ${prefix}addbonus число @член) **Трябва да поканите истински човек, за да получите награда**`,
                incorrect: (prefix) => `${emojis.error} | Трябва да посочите валиден брой бонус поканите за добавяне. (Синтаксис: ${prefix}addbonus число @член)`
            },
            member: {
                missing: (prefix) => `${emojis.error} | Трябва да упомене член, за да добавите бонус поканите. (Синтаксис: ${prefix}addbonus число @член)`
            }
        },
        title: () => `📥 Бонус поканите са добавени`,
        field: (prefix, member) => `Напишете \`${prefix}invites ${member.user.tag}\` да видите новия брой поканите за **${member.user.username}**!`
    },

    removebonus: {
        errors: {
            bonus: {
                missing: (prefix) => `${emojis.error} | Трябва да посочите броя на бонус поканите за премахване. (Синтаксис: ${prefix}removebonus число @член)`,
                incorrect: (prefix) => `${emojis.error} | Трябва да посочите валиден брой бонус поканите за премахване. (Синтаксис: ${prefix}removebonus число @член)`
            },
            member: {
                missing: (prefix) => `${emojis.error} | Трябва да упомене член, за да премахнете бонус поканите. (Синтаксис: ${prefix}removebonus число @член)`
            }
        },
        title: () => `📥 Бонус поканите са премахнати`,
        field: (prefix, member) => `Напишете \`${prefix}invites ${member.user.tag}\` да видите новия брой поканите за **${member.user.username}**!`
    },

    setdmjoin: {
        on: () => `**${emojis.success} | Системата за присъединяване на DM е сега __АКТИВИРАНА__!**`,
        off: () => `**${emojis.success} | Системата за присъединяване на DM е сега __ДЕАКТИВИРАНА__!**`
    },

    setjoin: {
        on: () => `**${emojis.success} | Системата за присъединяване е сега __АКТИВИРАНА__!**`,
        off: () => `**${emojis.success} | Системата за присъединяване е сега __ДЕАКТИВИРАНА__!**`
    },

    setleave: {
        on: () => `**${emojis.success} | Системата за напускане е сега __АКТИВИРАНА__!**`,
        off: () => `**${emojis.success} | Системата за напускане е сега __ДЕАКТИВИРАНА__!**`
    },

    setprefix: {
        missing: () => `${emojis.error} | Трябва да посочите префикс!`,
        success: () => `${emojis.success} | Префиксът на сървъра е успешно актуализиран!`
    },

    testdmjoin: {
        title: () => `:wrench: Система за присъединяване на DM :`,
        description: () => `Ако това не работи, проверете разрешенията на бота или се присъедините към [сървър за поддръжка](${discord})`,
        fields: {
            enabled: () => `> Активирано:`,
            message: () => `> Съобщение:`
        },
        enabled: (prefix) => `${emojis.success} Съобщенията за присъединяване на DM са активирани. Деактивирайте с \`${prefix}setdmjoin\`.`,
        disabled: (prefix) =>  `${emojis.error} Съобщенията за присъединяване на DM са деактивирани. Активирайте с \`${prefix}setdmjoin\`.`,
        notDefineds: {
            message: (prefix) => `Съобщението не е дефинирано. Задайте с \`${prefix}configdm\`!`
        }
    },

    testjoin: {
        title: () => `:wrench: Система за присъединяване :`,
        description: () => `Ако това не работи, проверете разрешенията на бота или се присъедините към [сървър за поддръжка](${discord})`,
        fields: {
            enabled: () => `> Активирано:`,
            channel: () => `> Канал:`,
            message: () => `> Съобщение:`
        },
        enabled: (prefix) => `${emojis.success} Съобщенията за присъединяване са активирани. Деактивирайте с \`${prefix}setjoin\`.`,
        disabled: (prefix) =>  `${emojis.error} Съобщенията за присъединяване са деактивирани. Активирайте с \`${prefix}setjoin\`.`,
        notDefineds: {
            message: (prefix) => `Съобщението не е дефинирано. Задайте с \`${prefix}configjoin\`!`,
            channel: (prefix) => `Каналът не е дефиниран. Задайте с \`${prefix}configjoin\`!`
        }
    },

    testleave: {
        title: () => `:wrench: Система за напускане :`,
        description: () => `Ако това не работи, проверете разрешенията на бота или се присъедините към [сървър за поддръжка](${discord})`,
        fields: {
            enabled: () => `> Активирано:`,
            channel: () => `> Канал:`,
            message: () => `> Съобщение:`
        },
        enabled: (prefix) => `${emojis.success} Съобщенията за напускане са активирани. Деактивирайте с \`${prefix}setleave\`.`,
        disabled: (prefix) =>  `${emojis.error} Съобщенията за напускане са деактивирани. Активирайте с \`${prefix}setleave\`.`,
        notDefineds: {
            message: (prefix) => `Съобщението не е дефинирано. Задайте с \`${prefix}configleave\`!`,
            channel: (prefix) => `Каналът не е дефиниран. Задайте с \`${prefix}configleave\`!`
        }
    },

    config: {
        title: (guildName) => `Конфигурация ${guildName}`,
        join: {
            title: (enabled) => `${(enabled ? emojis.success : emojis.error)} Съобщения за присъединяване`,
            content: (guild, data) => `
            > Активирано: ${data.guild.join.enabled ? "**да**" : "**не**"}
            > Съобщение: ${data.guild.join.message ? "**задано**" : "**не е задано**."}
            > Канал: ${!data.guild.join.channel ? "**не е задан**" : (guild.channels.cache.get(data.guild.join.channel) ? "**задан**" : "**каналът не е намерен**")}`
        },
        leave: {
            title: (enabled) => `${(enabled ? emojis.success : emojis.error)} Съобщения за напускане`,
            content: (guild, data) => `
            > Активирано: ${data.guild.leave.enabled ? "**да**" : "**не**"}
            > Съобщение: ${data.guild.leave.message ? "**задано**" : "**не е задано**."}
            > Канал: ${!data.guild.leave.channel ? "**не е задан**" : (guild.channels.cache.get(data.guild.leave.channel) ? "**задан**" : "**каналът не е намерен**")}`
        },
        joinDM: {
            title: (enabled) => `${(enabled ? emojis.success : emojis.error)} Съобщения за присъединяване на DM`,
            content: (guild, data) => `
            > Активирано: ${data.guild.joinDM.enabled ? "**да**" : "**не**"}
            > Съобщение: ${data.guild.joinDM.message ? "**задано**" : "**не е задано**."}`
        },
    },

    joinDM: {
        premium: (username) => `:crown: | Привет, **${username}**! Тази функция е налична само за преимум и партньорски сървъри. Вземете преимум: **скоро** !`
    },

    antispam: {
        cooldown: (username) => `Забавете! Моля, изчакайте 5 секунди и опитайте отново!`
    },

    configdmjoin: {
        disable: (prefix) => `Напишете \`${prefix}setdmjoin\` за деактивиране на съобщенията за присъединяване на DM.`,
        instruct: (str) => `
__**Допълнителна информация**__
\`\`\`
{user} : Спомене на членът който се присъедини към сървъра.
{user.name} : Име на членът който се присъедини към сървъра.
{user.tag} : Таг на членът който се присъедини към сървъра.
{user.createdat} : Възраст на профила на членът.

{guild} : Име на сървъра.
{guild.count} : Текущ брой членове на вашия сървър.

{inviter} : Спомене на поканващия.
{inviter.name} : Име на поканващия.
{inviter.tag} : Таг на поканващия.
{inviter.invites} : Общ брой поканите от поканващия.

{invite.code} : Използван код на покана.
{invite.url} : Използван URL на покана.
{invite.uses} : Колко пъти е използван кодът на покана.
\`\`\`
Напишете \`cancel\` за отмяна. ${str}


:pencil: **| Сега напишете съобщение за присъединяване на DM... :pencil2:**`,
        cancelled: () => `:x: Отмено.`,
        success: () => `✅ **| Готово..**`,
        title: () => `**Съобщение за присъединяване на DM е задано**`,
        fields: {
            message: () => `Съобщение:`,
            testIt: () => `Тест:`,
            cmd: (prefix) => `Използвайте \`${prefix}testdmjoin\` за тестване на новото съобщение.`
        },

    },

    configjoin: {
        longmessage: () => `<:error:753232040199192657> | Вашето съобщение трябва да бъде по-малко от 850 знака.`, 
        disable: (prefix) => `Напишете \`${prefix}setjoin\` за деактивиране на съобщенията за присъединяване.`,
        instructs: {
            message: (str) => `
__**Допълнителна информация**__
\`\`\`
{user} : Спомене на членът който се присъедини към сървъра.
{user.name} : Име на членът който се присъедини към сървъра.
{user.tag} : Таг на членът който се присъедини към сървъра.
{user.createdat} : Възраст на профила на членът.

{guild} : Име на сървъра.
{guild.count} : Текущ брой членове на вашия сървър.

{inviter} : Спомене на поканващия.
{inviter.name} : Име на поканващия.
{inviter.tag} : Таг на поканващия.
{inviter.invites} : Общ брой поканите от поканващия.

{invite.code} : Използван код на покана.
{invite.url} : Използван URL на покана.
{invite.uses} : Колко пъти е използван кодът на покана.
\`\`\`
Напишете \`cancel\` за отмяна. ${str}


:pencil: **| Сега напишете съобщение за присъединяване... :pencil2:**`,
            channel: () => `:scroll: **| Сега посочете канала... :pencil2:**`
        },
        cancelled: () => `:x: Отмено.`,
        success: () => `✅ **| Готово..**`,
        title: () => `**Съобщение за присъединяване е задано**`,
        fields: {
            message: () => `Съобщение:`,
            channel: () => `Канал:`,
            testIt: () => `Тест:`,
            cmd: (prefix) => `Използвайте \`${prefix}testjoin\` за тестване на новото съобщение.`
        },
        errors: {
            channelNotFound: (channel) => `${emojis.error} | Каналът не е намерен за \`${channel}\``
        }
    },

    configleave: {
        disable: (prefix) => `Напишете \`${prefix}setleave\` за деактивиране на съобщенията за напускане.`,
        instructs: {
            message: (str) => `
__**Допълнителна информация**__
\`\`\`
{user} : Спомене на членът който напусна сървъра.
{user.name} : Име на членът който напусна сървъра.
{user.tag} : Таг на членът който напусна сървъра.
{user.createdat} : Възраст на профила на членът.

{guild} : Име на сървъра.
{guild.count} : Текущ брой членове на вашия сървър.

{inviter} : Спомене на поканващия.
{inviter.name} : Име на поканващия.
{inviter.tag} : Таг на поканващия.
{inviter.invites} : Общ брой поканите от поканващия.

{invite.code} : Използван код на покана.
{invite.url} : Използван URL на покана.
{invite.uses} : Колко пъти е използван кодът на покана.
\`\`\`
Напишете \`cancel\` за отмяна. ${str}


:pencil: **| Сега напишете съобщение за напускане... :pencil2:**`,
            channel: () => `:scroll: **| Сега посочете канала... :pencil2:**`
        },
        cancelled: () => `:x: Отмено.`,
        success: () => `✅ **| Готово..**`,
        title: () => `**Съобщение за напускане е задано**`,
        fields: {
            message: () => `Съобщение:`,
            channel: () => `Канал:`,
            testIt: () => `Тест:`,
            cmd: (prefix) => `Използвайте \`${prefix}testleave\` за тестване на новото съобщение`
        },
        errors: {
            channelNotFound: (channel) => `${emojis.error} | Каналът не е намерен за \`${channel}\``
        }
    },

    setlang: {
        invalid: () => `${emojis.error} | Трябва да посочите валидна реч!\n\n:flag_fr: Français (\`fr\`)\n:flag_gb: English (\`en\`)\n:flag_tr: Türkçe (\`tr\`)\n:flag_ru: Русский (\`ru\`)\n:flag_jp: 日本語 (\`jp\`)\n:flag_in: हिंदी (\`hi\`)\n:flag_pt: Português (\`pt\`)\n:flag_br: Português Brasileiro (\`br\`)\n:flag_es: Español (\`es\`)\n:flag_de: Deutsch (\`de\`)\n:flag_it: Italiano (\`it\`)\n:flag_pl: Polski (\`pl\`)\n:flag_nl: Nederlands (\`nl\`)\n:flag_se: Svenska (\`sv\`)\n:flag_no: Norsk (\`no\`)\n:flag_dk: Dansk (\`da\`)\n:flag_fi: Suomi (\`fi\`)\n:flag_gr: Ελληνικά (\`el\`)\n:flag_cz: Čeština (\`cs\`)\n:flag_hu: Magyar (\`hu\`)\n:flag_ro: Română (\`ro\`)\n:flag_rs: Српски (\`sr\`)\n:flag_hr: Hrvatski (\`hr\`)\n:flag_bg: Български (\`bg\`)\n:flag_ua: Українська (\`uk\`)`,
        success: () => `${emojis.success} | :flag_bg: Езикът на сървъра е сега български!`
    },

    graph: {
        title: (server, days) => `Присъединено на ${server} през последните ${days} дни`,
        content: (total, percent, from, to) => `**${total}** членове (т.е. **${percent}%** от сървъра) се присъедини към сървъра от ${from} до ${to}:`,
        invalid: () => `Трябва да посочите валиден брой дни (по-голям от 1 и по-малко от 1000) за показване!`,
        months: () =>[
            "Янв",
            "Февр",
            "Март",
            "Апр",
            "Май",
            "Юни",
            "Юли",
            "Авг",
            "Септ",
            "Окт",
            "Ноем",
            "Дек"
        ],
        
    },

    website: {
        doc: {
            variables: () => `https://invite-count.xyz/configuration/variables`
        },
        utils: {
            members: () => `членове`
        },
        conf: {
            title: () => `Конфигурация`
        },
        selector: {
            title: () => `Избор`,
            manage: () => `Управление`,
            no: {
                title: () => `Няма сървъри`,
                content: () => `Сървърът не е намерен. Моля, проверете че сте влезли с правилния профил.`
            }
        },
        help: {
            title: () => `Помощ`,
            doc: () => `Документация`,
            support: () => `Сървър за поддръжка`
        },
        forms: {
            buttons: {
                enable: () => `Активиране на съобщенията`,
                disable: () => `Деактивиране на съобщенията`,
                update: () => `Актуализиране на съобщенията`
            },
            basic: {
                title: () => `Основна конфигурация`,
                language: () => `Език`,
                prefix: () => `Префикс`,
                update: () => `Актуализиране`
            },
            join: {
                title: () => `Съобщения за присъединяване`,
                message: {
                    title: () => `Съобщение`,
                    default: () => `{user} се присъедини към сървъра! Поканен от **{inviter.tag}** ({inviter.invites} поканите).`
                },
                channel: {
                    title: () => `Канал`
                },
            },
            leave: {
                title: () => `Съобщения за напускане`,
                message: {
                    title: () => `Съобщение`,
                    default: () => `{user.username} напусна сървъра. Поканен от **{inviter.tag}** ({inviter.invites} поканите).`
                },
                channel: {
                    title: () => `Канал`
                }
            },
            joinDM: {
                title: () => `Съобщения за присъединяване на DM`,
                premium: () => `Тази функция е налична за преимум и партньорски сървъри.`,
                message: {
                    title: () => `Съобщение`,
                    default: () => `Добре дошли {user}! Присъедини се на **{server}**! Поканен от **{inviter.tag}**. Не забравете да прочетете правилата на сървъра!`,
                }
            }
        }
    },

    removeinvites: {
        loading: {
            all: (prefix) => `${emojis.loading} | Процесът на премахване на поканите на сървъра е започнат... Можете да ги възстановите с командата \`${prefix}restore-invites\`!`,
            member: (prefix, member) => `${emojis.loading} | Процесът на премахване на поканите на **${member.user.tag}}** е започнат... Можете да ги възстановите с командата \`${prefix}restore-invites ${member.user.tag}\`!`
        },
        title: () => `☄️ Поканите са нулирани`,
        titles: {
            all: (prefix) => `${emojis.success} | Поканите на сървъра са нулирани! Можете да ги възстановите с командата \`${prefix}restore-invites\`!`,
            member: (prefix, member) => `${emojis.success} | Поканите на **${member.user.tag}}** са нулирани! Можете да ги възстановите с командата \`${prefix}restore-invites ${member.user.tag}\`!`
        }
    },

    restoreinvites: {
        confirmations: {
            all: (prefix, memberCount) => `${emojis.warn} | Сигурни ли сте, че искате да възстановите поканите на сървъра? Всички членове ще получат поканите преди последното изпълнение на командата \`${prefix}remove-invites\` (или 0, ако командата никога не е била изпълнена).\n\n:information_source: **Резюме на поканите**:\nЩе бъдат възстановени, общо: **${memberCount.invites}** нормални, **${memberCount.bonus}** бонус, **${memberCount.leaves}** напускания, **${memberCount.fake}** фалшиви.\n\n${emojis.success} Напишете \`-confirm\` за потвърждение.\n${emojis.error} Напишете \`cancel\` за отмяна.`,
            member: (prefix, member) => `${emojis.warn} | Сигурни ли сте, че искате да възстановите поканите на **${member.user.tag}}**? Ще получите поканите преди последното изпълнение на командата \`${prefix}remove-invites\` (или 0, ако командата никога не е била изпълнена).\n\n:information_source: **Резюме на поканите**:\nЩе бъдат възстановени: **${member.data.old_invites}** нормални, **${member.data.old_bonus}** бонус, **${member.data.old_leaves}** напускания, **${member.data.old_fake}** фалшиви.\n\n${emojis.success} Напишете \`-confirm\` за потвърждение.\n${emojis.error} Напишете \`cancel\` за отмяна.`,
            cancelled: () => `${emojis.error} Отмено.`
        },
        loading: {
            all: () => `${emojis.loading} | Процесът на възстановяване на поканите на сървъра е започнат....`,
            member: (member) => `${emojis.loading} | Процесът на възстановяване на поканите на **${member.user.tag}}** е започнат...`
        },
        title: () => `☄️ Поканите са възстановени`,
        titles: {
            all: () => `${emojis.success} | Поканите на сървъра са възстановени!`,
            member: (member) => `${emojis.success} | Поканите на **${member.user.tag}}** са възстановени!`
        }
    },

    syncinvites: {
        no: () => `${emojis.error} | Няма поканите за синхронизация.`,
        confirmations: {
            all: (inviteCount) => `${emojis.warn} | Сигурни ли сте, че искате да синхронизирате поканите на сървъра?\n\n:information_source: **Резюме на поканите**:\n**${Math.round(inviteCount)}** нормални поканите ще бъдат възстановени.\n\n${emojis.success} Напишете \`-confirm\` за потвърждение.\n${emojis.error} Напишете \`cancel\` за отмяна.`,
            cancelled: () => `${emojis.error} Отмено.`
        },
        title: () => `☄️ Поканите са синхронизирани`,
        titles: {
            all: () => `${emojis.success} | Поканите на сървъра са синхронизирани!`
        }
    },

    add: {
        content: (id) => `Можете да ме добавите към вашия сървър, като щракнете [тук](https://discordapp.com/oauth2/authorize?client_id=${id}&scope=bot&permissions=2146958847).`,
        requested: (username) => `Поискано от ${username}`
    },

    support: {
        content: (id) => `Можете да се присъедините към нашия сървър за поддръжка, като щракнете [тук](https://discord.gg/f7f2P2q).`,
        requested: (username) => `Поискано от ${username}`
    }

};
