const { emojis, discord } = require("../config");

module.exports = {

    locale: "hi_IN",

    utils: {
        prefix: (prefix) => `मेरा वर्तमान प्रीफिक्स \`${prefix}\`है\nअधिक सहायता के लिए \`${prefix}help\` का उपयोग करें।`,
        viewConf: () => `[डैशबोर्ड पर कॉन्फ़िगरेशन देखें](https://invite-count.xyz)`,
        conf: {
            title: () => `डैशबोर्ड पर कॉन्फ़िगरेशन देखें`,
            content: () => `[या डैशबोर्ड पर](https://invite-count.xyz)`
        },
        specialMessages: {
            join: {
                oauth2: (user) => `${user} OAuth का उपयोग करके सर्वर में शामिल हुए।`,
                
                vanity: (user) => `${user} सर्वर स्वामी द्वारा परिभाषित discord.gg निमंत्रण का उपयोग करके सर्वर में शामिल हुए।`,
                unknown: (user) => `मैं समझ नहीं सकता कि ${user} सर्वर में कैसे शामिल हुए।`,
                perm: (user) => `${emojis.error} | ${user} को किसने आमंत्रित किया यह जानने के लिए मुझे सर्वर प्रबंधन अनुमति की आवश्यकता है।`
            },
            leave: {
                oauth2: (user) => `${user} सर्वर से चले गए, OAuth के माध्यम से शामिल हुए थे।`,
                vanity: (user) => `${user} सर्वर से चले गए, सर्वर स्वामी द्वारा परिभाषित discord.gg निमंत्रण के माध्यम से शामिल हुए थे।`,
                unknown: (user) => `${user} सर्वर से चले गए, लेकिन मैं समझ नहीं सकता कि वे कैसे शामिल हुए।`
            }
        }
    },

    errors: {
        missingPerms: (neededPermissions) => `__**${emojis.error} अनुमतियां नहीं हैं**__\n\nइस कमांड के सही ढंग से काम करने के लिए मुझे निम्नलिखित अनुमतियां चाहिए: ${neededPermissions.map((p) => "`"+p+"`").join(", ")}`,
        disabled: () => `${emojis.error} | यह कमांड वर्तमान में अक्षम है!`,
        permLevel: (name) => `${emojis.error} | इस कमांड को अनुमति स्तर की आवश्यकता है: \`${name}\`!`,
        sendPerm: () => `${emojis.error} | मेरे पास इस चैनल में संदेश भेजने की अनुमति नहीं है।`,
        missingAdmin: () => `${emojis.error} | इस कार्य को करने के लिए मुझे \`सर्वर प्रबंधन\` अनुमति की आवश्यकता है`
    },
    glogs: {
        err: () => `<:error:851490719934840872> | वर्तमान चैनल पहले से ही यह चैनल है!`,
        success: () => `<:succes:851491428563812382> | लॉग चैनल सफलतापूर्वक सेट किया गया।`
    },
    glist: {
        title: () => `🎁 गिवअवे सूची`,
        description: (prefix) => `गिवअवे शुरू करने के लिए \`${prefix}gstart\` का उपयोग करें। केवल पूरे न किए गए गिवअवे दिखाए जाते हैं`,
        fields: {
            name: () => `> सूची`,
            message: (gs) => `${gs.map(ginfos=>`<:channel:851482936787730472> [${ginfos.prize}](${ginfos.messageURL}) : ${ginfos.endAt} को समाप्त होगा`).join("\n")} `
        },
        err: () => `<:error:851490719934840872> | इस सर्वर पर कोई पूरे न किए गए गिवअवे नहीं हैं`,

    },
    help: {
        title: () => `ℹ InviteCount मदद पृष्ठ`,
        description: (guildName, prefix) => `InviteCount आपको आमंत्रणों को ट्रैक करके अपने सर्वर के सदस्यों को प्रबंधित करने देता है।\n\n**दस्तावेज़** [यहां](https://docs.invite-count.xyz/) देखे जा सकते हैं।`,
        // Admin
        moderation: {
            title: () => `🛡️ **मॉडरेशन**`,
            content: (prefix) => "> `ban`, `kick`, `unban`"},
        admin: {
            title: () => `⚙️ **प्रशासन**`,
            content: (prefix) => "> `addbonus`, `removebonus`, `sync-invites`, `removeinvites`, `restoreinvites`, `setprefix`, `setlang`, `config`"},
        // Join DM Messages
        joinDM: {
            title: () => `💻 **सामान्य**`,
            content: (prefix) => "> `infos`, `add`, `membercount`, `userinfo`, `support`, `credits`, `invites`, `leaderboard`"},
        // Join Messages
        join: {
            title: () => `:tools: **कॉन्फ़िगरेशन**`,
            content: (prefix) => "> `configjoin`, `setjoin`, `testjoin`, `configleave`, `setleave`, `testleave`, `configdm`, `setdm`, `testdm`"},
        // Leave Messages
        leave: {
            title: () => `:envelope: छोड़ने के संदेश`,
            content: (prefix) => "`configleave`, `setleave`, `testleave`"},
        // Giveaways
        giveaway: {
            title: () => `🎁 **गिवअवे**`,
            content: (prefix) => "> `gstart`, `gend`, `glist`, `glogs`, `greroll`"},
        // Invites
        invites: {
            title: () => `:wave: आमंत्रण`,
            content: (prefix) => "`invite`, `leaderboard`"},
        // ManageInvite
        manageInvite: {
            title: () => `💠 उपयोगिताएं`,
            content: (prefix) => "`membercount`, `userinfo`, `botinfos`, `ping`, `creators`, `support`, `credits`, `add`"},
        // Others
        tip: (prefix) => `🔗 लिंक :`,
        links: (clientID) => `[मुझे जोड़ें](https://discordapp.com/api/oauth2/authorize?client_id=${clientID}&permissions=8&scope=bot) ● [वेबसाइट](https://invite-count.xyz) ● [समर्थन सर्वर](${discord}) ● [मेरे लिए वोट करें](https://discord.boats/bot/${clientID}/vote)`
    },

    infos: {
        title: () => `**InviteCount**`,
        content: () => `InviteCount आपको आमंत्रणों को ट्रैक करके अपने सर्वर के सदस्यों को प्रबंधित करने देता है।`,

        dev: {
            title: () => `**जानकारी**`,
            content: (uptime) => `<:arrow:766358167382523944> **डेवलपर्स:** Npg, Alex, Alboom\n <:arrow:766358167382523944> **लाइब्रेरी:** [discord.js v14.14.1](https://discord.js.org/#/)\n <:arrow:766358167382523944> **अपटाइम** ${uptime}\n <:arrow:766358167382523944> **निर्माण तिथि:** 12 मई 2019`
        },
        statistics: {
            title: () => `**आंकड़े**`,
            content: (guilds, users, channels, ping, ram, shardID) => `<:arrow:766358167382523944> **सर्वर:** ${guilds}\n<:arrow:766358167382523944> **उपयोगकर्ता**: ${channels}\n<:arrow:766358167382523944> **चैनल:** ${users}`
        },
        link: {
            title: () => `**लिंक**`,
            content: () => `<:arrow:766358167382523944> **समर्थन सर्वर:** [क्लिक करें](${discord})\n<:arrow:766358167382523944> **निमंत्रण:** [क्लिक करें](https://discordapp.com/api/oauth2/authorize?client_id=577236734245470228&permissions=8&scope=bot)`
        }
    },

    credits: {
        title: () => `**InviteCount**`,
        content: () => `InviteCount आपको आमंत्रणों को ट्रैक करके अपने सर्वर के सदस्यों को प्रबंधित करने देता है।`,

        dev: {
            title: () => `**डेवलपर :**`,
            content: (uptime) => `[Npg](https://github.com/ThisDudeBoy)\n[Alex](https://discord.com)\n[Alboom](https://discord.com)`
        },
        statistics: {
            title: () => `**से प्रेरित :**`,
            content: (guilds, users, channels, ping, ram, shardID) => `[ManageInvite](https://github.com/ManageInvite/ManageInvite)\n[InviteManager](https://github.com/SideProjectGuys/invite-manager-bot)`
        },
        link: {
            title: () => `**विशेष धन्यवाद :**`,
            content: () => `⭐ **Androz** ManageInvite में मदद के लिए!\n🎁 **Pauldb09** गिवअवे सिस्टम के लिए\n👨‍🏭 पूरी टीम & अनुवादक`
        }
    },

    invite: {
        description: (member, memberData, isYou, nextRank, role) => `${isYou ? `आपके पास` : `**${member.user.username}**के पास`} **${memberData.invites + memberData.bonus - memberData.leaves - memberData.fake}** आमंत्रण हैं! (**${memberData.invites}** सामान्य, **${memberData.bonus}** बोनस, **${memberData.fake > 0 ? `-${memberData.fake}` : `${memberData.fake}`}** नकली, **${memberData.leaves > 0 ? `-${memberData.leaves}` : `${memberData.leaves}`}** छोड़ना)${nextRank ? `\nअगली रैंक **${role}** प्राप्त करने के लिए आपको **${Math.round(nextRank.inviteCount - (memberData.invites + memberData.bonus - memberData.leaves - memberData.fake))}** अधिक आमंत्रणों की आवश्यकता है!` : ""}`
    },

    inviter: {
        description: (member, inviterName) => `**${member.user.username}** was invited by **${inviterName}**`,
        unknown: () => `Unknown`,
        notFound: () => `Inviter not found (user may have been deleted)`
    },
    leaderboard: {
        cleared: () => `${emojis.success} | लीडरबोर्ड साफ किया गया!`,
        user: (user, member, lb) => `${lb} **${user.username}** - **${member.calculatedInvites}** आमंत्रण (**${member.invites}** सामान्य, **${member.bonus}** बोनस, **${member.fake > 0 ? `-${member.fake}` : `${member.fake}`}** नकली, **${member.leaves > 0 ? `-${member.leaves}` : `${member.leaves}`}** छोड़ना)`,
        prompt: () => `{{user}}, आप किस पृष्ठ पर जाना चाहते हैं? रद्द करने के लिए \`cancel\` या \`0\` टाइप करें।`,
        title: () => `आमंत्रण लीडरबोर्ड`,
        empty: {
            title: () => `😕 कोई आमंत्रण नहीं मिला`,
            content: () => `लोगों को आमंत्रित करना शुरू करें और आप इस पृष्ठ पर दिखाई देंगे!`
        }
    },

    userinfo: {
        title: (user) => `${user.tag} खाता (${user.id})`,
        fields: {
            // user
            createdAt: {
                title: () => `<:createdAt:741247823269593118> निर्माण`
            },
            bot: {
                title: () => `<:maestro_robot:749985600110723184> बॉट`,
                content: (user) => user.bot ? "हां" : "नहीं"
            },
            // member
            joinedAt: {
                title: () => `<:join:741252065585660014> शामिल`
            },
            joinWay: {
                title: () => `शामिल होने का तरीका`,
                oauth: () => `OAuth निमंत्रण (discordapp.com के माध्यम से)।`,
                vanity: () => `व्यवस्थापक द्वारा सेट किया गया कस्टम निमंत्रण।`,
                unknown: (user) => `मैं समझ नहीं सकता कि ${user.username} सर्वर में कैसे शामिल हुए।`,
                invite: (user) => user.tag
            },
            invites: {
                title: () => `✉️ आमंत्रण`,
                content: (inviteData) => `**${inviteData.invites + inviteData.bonus - inviteData.leaves - inviteData.fake}** आमंत्रण (**${inviteData.invites}** सामान्य, **${inviteData.bonus}** बोनस, **${inviteData.fake > 0 ? `-${inviteData.fake}` : `${inviteData.fake}`}** नकली, **${inviteData.leaves > 0 ? `-${inviteData.leaves}` : `${inviteData.leaves}`}** छोड़ना)`
            },
            joinOrder: {
                title: () => `➡️ शामिल होने का क्रम`,
                content: (previous, next, user) => `${previous ? `**${previous.tag}** > ` : ""}**${user.tag}**${next ? ` > **${next.tag}**` : ""}`
            }
        }
    },

    kick: {
        errors:{
            missingPerms: "<:error:753232040199192657> | आपके पास `KICK_MEMBERS` अनुमति होनी चाहिए",
            nouser: "<:error:753232040199192657> | कृपया एक उपयोगकर्ता का उल्लेख करें",
            supperior: "<:error:753232040199192657> | आप अपने से ऊपर के उपयोगकर्ता को किक नहीं कर सकते",
            noperm: "<:error:753232040199192657> | एक त्रुटि हुई... कृपया जांचें कि मेरे पास इस सदस्य को किक करने की अनुमति है और फिर से प्रयास करें!",
            
        },
        description: "<:success:753232040073101363> | उपयोगकर्ता को सफलतापूर्वक किक किया गया",
        banneddm: (server, moderator, reason) => "आपको **" + server + "** से **" + moderator + "** द्वारा किक किया गया था\n**कारण** : `" + reason + "`" 
    },

    ban: {
        errors:{
            missingPerms: "<:error:753232040199192657> | आपके पास `BAN_MEMBERS` अनुमति होनी चाहिए",
            nouser: "<:error:753232040199192657> | कृपया एक उपयोगकर्ता का उल्लेख करें",
            supperior: "<:error:753232040199192657> | आप अपने से ऊपर के उपयोगकर्ता को प्रतिबंधित नहीं कर सकते",
            noperm: "<:error:753232040199192657> | एक त्रुटि हुई... कृपया जांचें कि मेरे पास इस सदस्य को प्रतिबंधित करने की अनुमति है और फिर से प्रयास करें!",
            
        },
        description: "<:success:753232040073101363> | उपयोगकर्ता को सफलतापूर्वक प्रतिबंधित किया गया",
        banneddm: (server, moderator, reason) => "आपको **" + server + "** से **" + moderator + "** द्वारा प्रतिबंधित किया गया था\n**कारण** : `" + reason + "`" 
    },

    unban: {
        noid: "<:error:753232040199192657> | कृपया प्रतिबंध हटाने के लिए आईडी निर्दिष्ट करें",
        success: (user) => "<:success:753232040073101363> | " + user + " को सफलतापूर्वक प्रतिबंधित किया गया",
        noban: "<:error:753232040199192657> | यह उपयोगकर्ता प्रतिबंधित नहीं है"
    },

    membercount: {
        title: (guildName) => `${guildName} के सदस्यों की संख्या`,
        description: (guild) => `
        कुल **${guild.members.cache.size}** सदस्य (**${guild.members.cache.filter((m) => !m.user.bot).size}** लोग और **${guild.members.cache.filter((m) => m.user.bot).size}** बॉट)

        ➔ ${emojis.dnd} | ${guild.members.cache.filter((m) => m.presence.status === "dnd"  && !m.user.bot).size} सदस्य (परेशान न करें)
        ➔ ${emojis.online} | ${guild.members.cache.filter((m) => m.presence.status === "online" && !m.user.bot).size} सदस्य (ऑनलाइन)
        ➔ ${emojis.idle} | ${guild.members.cache.filter((m) => m.presence.status === "idle" && !m.user.bot).size} सदस्य (निष्क्रिय)
        ➔ ${emojis.offline} | ${guild.members.cache.filter((m) => m.presence.status === "offline" && !m.user.bot).size} सदस्य (ऑफलाइन)`
    },

    addbonus: {
        errors: {
            bonus: {
                missing: (prefix) => `${emojis.error} | आपको जोड़ने के लिए बोनस आमंत्रणों की संख्या निर्दिष्ट करनी चाहिए। (वाक्य रचना: ${prefix}addbonus नंबर @सदस्य) **पुरस्कार रैंक प्राप्त करने के लिए आपको एक वास्तविक व्यक्ति को आमंत्रित करना होगा**`,
                incorrect: (prefix) => `${emojis.error} | आपको जोड़ने के लिए बोनस आमंत्रणों की वैध संख्या निर्दिष्ट करनी चाहिए। (वाक्य रचना: ${prefix}addbonus नंबर @सदस्य)`
            },
            member: {
                missing: (prefix) => `${emojis.error} | आपको बोनस आमंत्रण जोड़ने के लिए एक सदस्य का उल्लेख करना होगा। (वाक्य रचना: ${prefix}addbonus नंबर @सदस्य)`
            }
        },
        title: () => `📥 बोनस आमंत्रण जोड़े गए`,
        field: (prefix, member) => `\`${prefix}invites ${member.user.tag}\` टाइप करके **${member.user.username}** के नए आमंत्रणों की संख्या देखें!`
    },

    removebonus: {
        errors: {
            bonus: {
                missing: (prefix) => `${emojis.error} | आपको हटाने के लिए बोनस आमंत्रणों की संख्या निर्दिष्ट करनी चाहिए। (वाक्य रचना: ${prefix}removebonus नंबर @सदस्य)`,
                incorrect: (prefix) => `${emojis.error} | आपको हटाने के लिए बोनस आमंत्रणों की वैध संख्या निर्दिष्ट करनी चाहिए। (वाक्य रचना: ${prefix}removebonus नंबर @सदस्य)`
            },
            member: {
                missing: (prefix) => `${emojis.error} | आपको बोनस आमंत्रण हटाने के लिए एक सदस्य का उल्लेख करना होगा। (वाक्य रचना: ${prefix}removebonus नंबर @सदस्य)`
            }
        },
        title: () => `📥 बोनस आमंत्रण हटाए गए`,
        field: (prefix, member) => `\`${prefix}invites ${member.user.tag}\` टाइप करके **${member.user.username}** के नए आमंत्रणों की संख्या देखें!`
    },

    setdmjoin: {
        on: () => `**${emojis.success} | डीएम शामिल प्रणाली अब __सक्षम है__!**`,
        off: () => `**${emojis.success} | डीएम शामिल प्रणाली अब __अक्षम है__!**`
    },

    setjoin: {
        on: () => `**${emojis.success} | शामिल प्रणाली अब __सक्षम है__!**`,
        off: () => `**${emojis.success} | शामिल प्रणाली अब __अक्षम है__!**`
    },

    setleave: {
        on: () => `**${emojis.success} | छोड़ने की प्रणाली अब __सक्षम है__!**`,
        off: () => `**${emojis.success} | छोड़ने की प्रणाली अब __अक्षम है__!**`
    },

    setprefix: {
        missing: () => `${emojis.error} | आपको एक प्रीफिक्स निर्दिष्ट करना होगा!`,
        success: () => `${emojis.success} | सर्वर प्रीफिक्स अपडेट किया गया!`
    },

    testdmjoin: {
        title: () => `:wrench: डीएम शामिल प्रणाली :`,
        description: () => `यदि यह काम नहीं कर रहा है, तो बॉट की अनुमतियों की जांच करें या [समर्थन सर्वर](${discord}) में शामिल हों`,
        fields: {
            enabled: () => `> सक्षम:`,
            message: () => `> संदेश:`
        },
        enabled: (prefix) => `${emojis.success} डीएम शामिल संदेश सक्षम हैं। \`${prefix}setdmjoin\` से अक्षम करें।`,
        disabled: (prefix) =>  `${emojis.error} डीएम शामिल संदेश अक्षम हैं। \`${prefix}setdmjoin\` से सक्षम करें।`,
        notDefineds: {
            message: (prefix) => `संदेश परिभाषित नहीं है। \`${prefix}configdm\` के साथ सेट करें!`
        }
    },

    testjoin: {
        title: () => `:wrench: शामिल प्रणाली :`,
        description: () => `यदि यह काम नहीं कर रहा है, तो बॉट की अनुमतियों की जांच करें या [समर्थन सर्वर](${discord}) में शामिल हों`,
        fields: {
            enabled: () => `> सक्षम:`,
            channel: () => `> चैनल:`,
            message: () => `> संदेश:`
        },
        enabled: (prefix) => `${emojis.success} शामिल संदेश सक्षम हैं। \`${prefix}setjoin\` से अक्षम करें।`,
        disabled: (prefix) =>  `${emojis.error} शामिल संदेश अक्षम हैं। \`${prefix}setjoin\` से सक्षम करें।`,
        notDefineds: {
            message: (prefix) => `संदेश परिभाषित नहीं है। \`${prefix}configjoin\` के साथ सेट करें!`,
            channel: (prefix) => `चैनल परिभाषित नहीं है। \`${prefix}configjoin\` के साथ सेट करें!`
        }
    },

    testleave: {
        title: () => `:wrench: छोड़ने की प्रणाली :`,
        description: () => `यदि यह काम नहीं कर रहा है, तो बॉट की अनुमतियों की जांच करें या [समर्थन सर्वर](${discord}) में शामिल हों`,
        fields: {
            enabled: () => `> सक्षम:`,
            channel: () => `> चैनल:`,
            message: () => `> संदेश:`
        },
        enabled: (prefix) => `${emojis.success} छोड़ने के संदेश सक्षम हैं। \`${prefix}setleave\` से अक्षम करें।`,
        disabled: (prefix) =>  `${emojis.error} छोड़ने के संदेश अक्षम हैं। \`${prefix}setleave\` से सक्षम करें।`,
        notDefineds: {
            message: (prefix) => `संदेश परिभाषित नहीं है। \`${prefix}configleave\` के साथ सेट करें!`,
            channel: (prefix) => `चैनल परिभाषित नहीं है। \`${prefix}configleave\` के साथ सेट करें!`
        }
    },

    config: {
        title: (guildName) => `${guildName} का कॉन्फ़िगरेशन`,
        join: {
            title: (enabled) => `${(enabled ? emojis.success : emojis.error)} शामिल संदेश`,
            content: (guild, data) => `
            > सक्षम: ${data.guild.join.enabled ? "**हां**" : "**नहीं**"}
            > संदेश: ${data.guild.join.message ? "**परिभाषित**" : "**अपरिभाषित**."}
            > चैनल: ${!data.guild.join.channel ? "**अपरिभाषित**" : (guild.channels.cache.get(data.guild.join.channel) ? "**परिभाषित**" : "**चैनल नहीं मिला**")}`
        },
        leave: {
            title: (enabled) => `${(enabled ? emojis.success : emojis.error)} छोड़ने के संदेश`,
            content: (guild, data) => `
            > सक्षम: ${data.guild.leave.enabled ? "**हां**" : "**नहीं**"}
            > संदेश: ${data.guild.leave.message ? "**परिभाषित**" : "**अपरिभाषित**."}
            > चैनल: ${!data.guild.leave.channel ? "**अपरिभाषित**" : (guild.channels.cache.get(data.guild.leave.channel) ? "**परिभाषित**" : "**चैनल नहीं मिला**")}`
        },
        joinDM: {
            title: (enabled) => `${(enabled ? emojis.success : emojis.error)} डीएम शामिल संदेश`,
            content: (guild, data) => `
            > सक्षम: ${data.guild.joinDM.enabled ? "**हां**" : "**नहीं**"}
            > संदेश: ${data.guild.joinDM.message ? "**परिभाषित**" : "**अपरिभाषित**."}`
        },
    },

    joinDM: {
        premium: (username) => `:crown: | नमस्ते, **${username}**! यह सुविधा केवल प्रीमियम सर्वर और साझेदारों के लिए उपलब्ध है। प्रीमियम प्राप्त करें: **जल्द ही** !`
    },

    antispam: {
        cooldown: (username) => `धीमे करो! कृपया 5 सेकंड प्रतीक्षा करें और फिर से कोशिश करें!`
    },

    configdmjoin: {
        disable: (prefix) => `डीएम शामिल संदेश अक्षम करने के लिए \`${prefix}setdmjoin\` टाइप करें।`,
        instruct: (str) => `
__**अतिरिक्त जानकारी**__
\`\`\`
{user} : जो सदस्य सर्वर में शामिल हुआ उसके लिए उल्लेख।
{user.name} : जो सदस्य सर्वर में शामिल हुआ उसका नाम।
{user.tag} : जो सदस्य सर्वर में शामिल हुआ उसका टैग।
{user.createdat} : सदस्य की खाता आयु।

{guild} : सर्वर का नाम।
{guild.count} : आपके सर्वर की वर्तमान सदस्य संख्या।

{inviter} : आमंत्रणकर्ता के लिए उल्लेख।
{inviter.name} : आमंत्रणकर्ता का नाम।
{inviter.tag} : आमंत्रणकर्ता का टैग।
{inviter.invites} : आमंत्रणकर्ता के कुल आमंत्रण।

{invite.code} : उपयोग किया गया आमंत्रण कोड।
{invite.url} : उपयोग किया गया आमंत्रण URL।
{invite.uses} : आमंत्रण कोड के उपयोग की संख्या।
\`\`\`
रद्द करने के लिए \`cancel\` टाइप करें। ${str}


:pencil: **| अब डीएम शामिल संदेश लिखें... :pencil2:**`,
        cancelled: () => `:x: रद्द किया गया।`,
        success: () => `✅ **| सफलतापूर्वक पूरा हुआ...**`,
        title: () => `**डीएम शामिल संदेश सेट किया गया**`,
        fields: {
            message: () => `संदेश:`,
            testIt: () => `इसे आज़माएं:`,
            cmd: (prefix) => `नए संदेश को परीक्षण करने के लिए \`${prefix}testdmjoin\` का उपयोग करें।`
        },

    },

    configjoin: {
        longmessage: () => `<:error:753232040199192657> | आपका संदेश 850 वर्णों से कम होना चाहिए।`, 
        disable: (prefix) => `शामिल संदेश अक्षम करने के लिए \`${prefix}setjoin\` टाइप करें।`,
        instructs: {
            message: (str) => `
__**अतिरिक्त जानकारी**__
\`\`\`
{user} : जो सदस्य सर्वर में शामिल हुआ उसके लिए उल्लेख।
{user.name} : जो सदस्य सर्वर में शामिल हुआ उसका नाम।
{user.tag} : जो सदस्य सर्वर में शामिल हुआ उसका टैग।
{user.createdat} : सदस्य की खाता आयु।

{guild} : सर्वर का नाम।
{guild.count} : आपके सर्वर की वर्तमान सदस्य संख्या।

{inviter} : आमंत्रणकर्ता के लिए उल्लेख।
{inviter.name} : आमंत्रणकर्ता का नाम।
{inviter.tag} : आमंत्रणकर्ता का टैग।
{inviter.invites} : आमंत्रणकर्ता के कुल आमंत्रण।

{invite.code} : उपयोग किया गया आमंत्रण कोड।
{invite.url} : उपयोग किया गया आमंत्रण URL।
{invite.uses} : आमंत्रण कोड के उपयोग की संख्या।
\`\`\`
रद्द करने के लिए \`cancel\` टाइप करें। ${str}


:pencil: **| अब शामिल संदेश लिखें... :pencil2:**`,
            channel: () => `:scroll: **| अब चैनल का उल्लेख करें... :pencil2:**`
        },
        cancelled: () => `:x: रद्द किया गया।`,
        success: () => `✅ **| सफलतापूर्वक पूरा हुआ...**`,
        title: () => `**शामिल संदेश सेट किया गया**`,
        fields: {
            message: () => `संदेश:`,
            channel: () => `चैनल:`,
            testIt: () => `इसे आज़माएं:`,
            cmd: (prefix) => `नए संदेश को परीक्षण करने के लिए \`${prefix}testjoin\` का उपयोग करें।`
        },
        errors: {
            channelNotFound: (channel) => `${emojis.error} | \`${channel}\` के लिए कोई चैनल नहीं मिला`
        }
    },

    configleave: {
        disable: (prefix) => `छोड़ने के संदेश अक्षम करने के लिए \`${prefix}setleave\` टाइप करें।`,
        instructs: {
            message: (str) => `
__**अतिरिक्त जानकारी**__
\`\`\`
{user} : जो सदस्य सर्वर छोड़ गया उसके लिए उल्लेख।
{user.name} : जो सदस्य सर्वर छोड़ गया उसका नाम।
{user.tag} : जो सदस्य सर्वर छोड़ गया उसका टैग।
{user.createdat} : सदस्य की खाता आयु।

{guild} : सर्वर का नाम।
{guild.count} : आपके सर्वर की वर्तमान सदस्य संख्या।

{inviter} : आमंत्रणकर्ता के लिए उल्लेख।
{inviter.name} : आमंत्रणकर्ता का नाम।
{inviter.tag} : आमंत्रणकर्ता का टैग।
{inviter.invites} : आमंत्रणकर्ता के कुल आमंत्रण।

{invite.code} : उपयोग किया गया आमंत्रण कोड।
{invite.url} : उपयोग किया गया आमंत्रण URL।
{invite.uses} : आमंत्रण कोड के उपयोग की संख्या।
\`\`\`
रद्द करने के लिए \`cancel\` टाइप करें। ${str}


:pencil: **| अब छोड़ने का संदेश लिखें... :pencil2:**`,
            channel: () => `:scroll: **| अब चैनल का उल्लेख करें... :pencil2:**`
        },
        cancelled: () => `:x: रद्द किया गया।`,
        success: () => `✅ **| सफलतापूर्वक पूरा हुआ...**`,
        title: () => `**छोड़ने का संदेश सेट किया गया**`,
        fields: {
            message: () => `संदेश:`,
            channel: () => `चैनल:`,
            testIt: () => `इसे आज़माएं:`,
            cmd: (prefix) => `नए संदेश को परीक्षण करने के लिए \`${prefix}testleave\` का उपयोग करें`
        },
        errors: {
            channelNotFound: (channel) => `${emojis.error} | \`${channel}\` के लिए कोई चैनल नहीं मिला`
        }
    },

    setlang: {
        invalid: () => `${emojis.error} | आपको एक वैध भाषा निर्दिष्ट करनी होगी!\n\n:flag_fr: Français (\`fr\`)\n:flag_gb: English (\`en\`)\n:flag_tr: Türkçe (\`tr\`)\n:flag_ru: Русский (\`ru\`)\n:flag_jp: 日本語 (\`jp\`)\n:flag_in: हिंदी (\`hi\`)\n:flag_pt: Português (\`pt\`)\n:flag_br: Português Brasileiro (\`br\`)\n:flag_es: Español (\`es\`)\n:flag_de: Deutsch (\`de\`)\n:flag_it: Italiano (\`it\`)\n:flag_pl: Polski (\`pl\`)\n:flag_nl: Nederlands (\`nl\`)`,
        success: () => `${emojis.success} | :flag_in: सर्वर भाषा अब हिंदी में सेट है!`
    },

    graph: {
        title: (server, days) => `${server} में पिछले ${days} दिनों में शामिल होना`,
        content: (total, percent, from, to) => `**${total}** सदस्य (अर्थात्, सर्वर का **${percent}%**) ${from} से ${to} तक सर्वर में शामिल हुए:`,
        invalid: () => `प्रदर्शित करने के लिए आपको दिनों की एक वैध संख्या दर्ज करनी होगी (1 से अधिक और 1000 से कम)!`,
        months: () =>[
            "जनवरी",
            "फरवरी",
            "मार्च",
            "अप्रैल",
            "मई",
            "जून",
            "जुलाई",
            "अगस्त",
            "सितंबर",
            "अक्टूबर",
            "नवंबर",
            "दिसंबर"
        ],
        
    },

    website: {
        doc: {
            variables: () => `https://invite-count.xyz/configuration/variables`
        },
        utils: {
            members: () => `सदस्य`
        },
        conf: {
            title: () => `कॉन्फ़िगरेशन`
        },
        selector: {
            title: () => `चयनकर्ता`,
            manage: () => `प्रबंधित करें`,
            no: {
                title: () => `कोई सर्वर नहीं`,
                content: () => `कोई सर्वर नहीं मिला। कृपया जांचें कि आप सही खाते से लॉगिन हैं।`
            }
        },
        help: {
            title: () => `मदद`,
            doc: () => `दस्तावेज़`,
            support: () => `समर्थन सर्वर`
        },
        forms: {
            buttons: {
                enable: () => `संदेश सक्षम करें`,
                disable: () => `संदेश अक्षम करें`,
                update: () => `संदेश अपडेट करें`
            },
            basic: {
                title: () => `मूल कॉन्फ़िगरेशन`,
                language: () => `भाषा`,
                prefix: () => `प्रीफिक्स`,
                update: () => `अपडेट`
            },
            join: {
                title: () => `शामिल संदेश`,
                message: {
                    title: () => `संदेश`,
                    default: () => `{user} सर्वर में शामिल हुआ! **{inviter.tag}** द्वारा आमंत्रित किया गया ({inviter.invites} आमंत्रण)।`
                },
                channel: {
                    title: () => `चैनल`
                },
            },
            leave: {
                title: () => `छोड़ने के संदेश`,
                message: {
                    title: () => `संदेश`,
                    default: () => `{user.username} सर्वर छोड़ गया। **{inviter.tag}** द्वारा आमंत्रित किया गया था ({inviter.invites} आमंत्रण)।`
                },
                channel: {
                    title: () => `चैनल`
                }
            },
            joinDM: {
                title: () => `डीएम शामिल संदेश`,
                premium: () => `यह सुविधा प्रीमियम सर्वर और साझेदारों के लिए उपलब्ध है।`,
                message: {
                    title: () => `संदेश`,
                    default: () => `{user} का स्वागत है! आप **{server}** में शामिल हुए! **{inviter.tag}** द्वारा आमंत्रित किया गया। सर्वर के नियमों को पढ़ना न भूलें!`,
                }
            }
        }
    },

    removeinvites: {
        loading: {
            all: (prefix) => `${emojis.loading} | सर्वर आमंत्रणों को हटाने की प्रक्रिया शुरू हो गई है... आप \`${prefix}restore-invites\` कमांड से उन्हें पुनर्स्थापित कर सकते हैं!`,
            member: (prefix, member) => `${emojis.loading} | **${member.user.tag}}** के आमंत्रणों को हटाने की प्रक्रिया शुरू हो गई है... आप \`${prefix}restore-invites ${member.user.tag}\` कमांड से उन्हें पुनर्स्थापित कर सकते हैं!`
        },
        title: () => `☄️ आमंत्रण रीसेट किए गए`,
        titles: {
            all: (prefix) => `${emojis.success} | सर्वर आमंत्रण रीसेट किए गए! आप \`${prefix}restore-invites\` कमांड से उन्हें पुनर्स्थापित कर सकते हैं!`,
            member: (prefix, member) => `${emojis.success} | **${member.user.tag}}** के आमंत्रण रीसेट किए गए! आप \`${prefix}restore-invites ${member.user.tag}\` कमांड से उन्हें पुनर्स्थापित कर सकते हैं!`
        }
    },

    restoreinvites: {
        confirmations: {
            all: (prefix, memberCount) => `${emojis.warn} | क्या आप सर्वर आमंत्रणों को पुनर्स्थापित करना चाहते हैं? सभी सदस्यों को \`${prefix}remove-invites\` कमांड के अंतिम निष्पादन से पहले के आमंत्रण मिलेंगे (या 0 यदि कमांड कभी निष्पादित नहीं हुआ)।\n\n:information_source: **आमंत्रणों का अवलोकन**:\nपुनर्स्थापित किया जाएगा, कुल: **${memberCount.invites}** सामान्य, **${memberCount.bonus}** बोनस, **${memberCount.leaves}** छोड़ना, **${memberCount.fake}** नकली।\n\n${emojis.success} पुष्टि करने के लिए \`-confirm\` टाइप करें।\n${emojis.error} रद्द करने के लिए \`cancel\` टाइप करें।`,
            member: (prefix, member) => `${emojis.warn} | क्या आप **${member.user.tag}}** के आमंत्रणों को पुनर्स्थापित करना चाहते हैं? \`${prefix}remove-invites\` कमांड के अंतिम निष्पादन से पहले के आमंत्रण प्राप्त करेंगे (या 0 यदि कमांड कभी निष्पादित नहीं हुआ)।\n\n:information_source: **आमंत्रणों का अवलोकन**:\nपुनर्स्थापित किया जाएगा: **${member.data.old_invites}** सामान्य, **${member.data.old_bonus}** बोनस, **${member.data.old_leaves}** छोड़ना, **${member.data.old_fake}** नकली।\n\n${emojis.success} पुष्टि करने के लिए \`-confirm\` टाइप करें।\n${emojis.error} रद्द करने के लिए \`cancel\` टाइप करें।`,
            cancelled: () => `${emojis.error} रद्द किया गया।`
        },
        loading: {
            all: () => `${emojis.loading} | सर्वर आमंत्रणों को पुनर्स्थापित करने की प्रक्रिया शुरू हो रही है....`,
            member: (member) => `${emojis.loading} | **${member.user.tag}}** के आमंत्रणों को पुनर्स्थापित करने की प्रक्रिया शुरू हो रही है...`
        },
        title: () => `☄️ आमंत्रण पुनर्स्थापित किए गए`,
        titles: {
            all: () => `${emojis.success} | सर्वर आमंत्रण पुनर्स्थापित किए गए!`,
            member: (member) => `${emojis.success} | **${member.user.tag}}** के आमंत्रण पुनर्स्थापित किए गए!`
        }
    },

    syncinvites: {
        no: () => `${emojis.error} | समन्वय करने के लिए कोई आमंत्रण नहीं है।`,
        confirmations: {
            all: (inviteCount) => `${emojis.warn} | क्या आप सर्वर आमंत्रणों को समन्वय करना चाहते हैं?\n\n:information_source: **आमंत्रणों का अवलोकन**:\n**${Math.round(inviteCount)}** सामान्य आमंत्रण पुनर्स्थापित किए जाएंगे।\n\n${emojis.success} पुष्टि करने के लिए \`-confirm\` टाइप करें।\n${emojis.error} रद्द करने के लिए \`cancel\` टाइप करें।`,
            cancelled: () => `${emojis.error} रद्द किया गया।`
        },
        title: () => `☄️ आमंत्रण समन्वित किए गए`,
        titles: {
            all: () => `${emojis.success} | सर्वर आमंत्रण समन्वित किए गए!`
        }
    },

    add: {
        content: (id) => `आप [यहां](https://discordapp.com/oauth2/authorize?client_id=${id}&scope=bot&permissions=2146958847) क्लिक करके मुझे अपने सर्वर में जोड़ सकते हैं।`,
        requested: (username) => `${username} द्वारा अनुरोधित`
    },

    support: {
        content: (id) => `आप [यहां](https://discord.gg/f7f2P2q) क्लिक करके समर्थन सर्वर में शामिल हो सकते हैं।`,
        requested: (username) => `${username} द्वारा अनुरोधित`
    }

};
