const { emojis, discord } = require("../config");

module.exports = {

    locale: "ru_RU",

    utils: {
        prefix: (prefix) => `Мой текущий префикс \`${prefix}\`\nИспользуйте \`${prefix}help\` для большей помощи.`,
        viewConf: () => `[Просмотр конфигурации на панели](https://invite-count.xyz)`,
        conf: {
            title: () => `Просмотр конфигурации на панели`,
            content: () => `[или на панели](https://invite-count.xyz)`
        },
        specialMessages: {
            join: {
                oauth2: (user) => `${user} присоединился к серверу через OAuth.`,
                
                vanity: (user) => `${user} присоединился к серверу, используя приглашение discord.gg, определённое владельцем сервера.`,
                unknown: (user) => `Я не могу понять, как ${user} присоединился к серверу.`,
                perm: (user) => `${emojis.error} | Мне нужны права на управление сервером, чтобы узнать, кто пригласил ${user}.`
            },
            leave: {
                oauth2: (user) => `${user} покинул сервер, присоединился через OAuth.`,
                vanity: (user) => `${user} покинул сервер, присоединился через приглашение discord.gg, определённое владельцем сервера.`,
                unknown: (user) => `${user} покинул сервер, но я не могу понять, как он присоединился.`
            }
        }
    },

    errors: {
        missingPerms: (neededPermissions) => `__**${emojis.error} Отсутствуют разрешения**__\n\nМне нужны следующие разрешения для правильной работы этой команды: ${neededPermissions.map((p) => "`"+p+"`").join(", ")}`,
        disabled: () => `${emojis.error} | Эта команда в настоящее время отключена!`,
        permLevel: (name) => `${emojis.error} | Эта команда требует уровня разрешения: \`${name}\`!`,
        sendPerm: () => `${emojis.error} | У меня нет разрешения на отправку сообщений в этом канале.`,
        missingAdmin: () => `${emojis.error} | Мне нужно разрешение \`Управление сервером\` для выполнения этого действия`
    },
    glogs: {
        err: () => `<:error:851490719934840872> | Текущий канал уже этот канал!`,
        success: () => `<:succes:851491428563812382> | Канал логов успешно установлен.`
    },
    glist: {
        title: () => `🎁 Список раздач`,
        description: (prefix) => `Для начала раздачи используйте \`${prefix}gstart\`. Отображаются только не завершённые раздачи`,
        fields: {
            name: () => `> Список`,
            message: (gs) => `${gs.map(ginfos=>`<:channel:851482936787730472> [${ginfos.prize}](${ginfos.messageURL}) : Закончится ${ginfos.endAt}`).join("\n")} `
        },
        err: () => `<:error:851490719934840872> | На этом сервере нет незавершённых раздач`,

    },
    help: {
        title: () => `ℹ Страница помощи InviteCount`,
        description: (guildName, prefix) => `InviteCount позволяет вам управлять членами вашего сервера, отслеживая их приглашения.\n\nПерейти к **документации** можно [здесь](https://docs.invite-count.xyz/).`,
        // Admin
        moderation: {
            title: () => `🛡️ **Модерация**`,
            content: (prefix) => "> `ban`, `kick`, `unban`"},
        admin: {
            title: () => `⚙️ **Администрация**`,
            content: (prefix) => "> `addbonus`, `removebonus`, `sync-invites`, `removeinvites`, `restoreinvites`, `setprefix`, `setlang`, `config`"},
        // Join DM Messages
        joinDM: {
            title: () => `💻 **Общее**`,
            content: (prefix) => "> `infos`, `add`, `membercount`, `userinfo`, `support`, `credits`, `invites`, `leaderboard`"},
        // Join Messages
        join: {
            title: () => `:tools: **Конфигурация**`,
            content: (prefix) => "> `configjoin`, `setjoin`, `testjoin`, `configleave`, `setleave`, `testleave`, `configdm`, `setdm`, `testdm`"},
        // Leave Messages
        leave: {
            title: () => `:envelope: Сообщения об уходе`,
            content: (prefix) => "`configleave`, `setleave`, `testleave`"},
        // Giveaways
        giveaway: {
            title: () => `🎁 **Раздачи**`,
            content: (prefix) => "> `gstart`, `gend`, `glist`, `glogs`, `greroll`"},
        // Invites
        invites: {
            title: () => `:wave: Приглашения`,
            content: (prefix) => "`invite`, `leaderboard`"},
        // ManageInvite
        manageInvite: {
            title: () => `💠 Утилиты`,
            content: (prefix) => "`membercount`, `userinfo`, `botinfos`, `ping`, `creators`, `support`, `credits`, `add`"},
        // Others
        tip: (prefix) => `🔗 Ссылки :`,
        links: (clientID) => `[Добавьте меня](https://discordapp.com/api/oauth2/authorize?client_id=${clientID}&permissions=8&scope=bot) ● [Веб-сайт](https://invite-count.xyz) ● [Сервер поддержки](${discord}) ● [Проголосуйте за меня](https://discord.boats/bot/${clientID}/vote)`
    },

    infos: {
        title: () => `**InviteCount**`,
        content: () => `InviteCount позволяет вам управлять членами вашего сервера, отслеживая их приглашения.`,

        dev: {
            title: () => `**Информация**`,
            content: (uptime) => `<:arrow:766358167382523944> **Разработчики:** Npg, Alex, Alboom\n <:arrow:766358167382523944> **Библиотека:** [discord.js v14.14.1](https://discord.js.org/#/)\n <:arrow:766358167382523944> **Время работы** ${uptime}\n <:arrow:766358167382523944> **Дата создания:** 12 мая 2019`
        },
        statistics: {
            title: () => `**Статистика**`,
            content: (guilds, users, channels, ping, ram, shardID) => `<:arrow:766358167382523944> **Серверы:** ${guilds}\n<:arrow:766358167382523944> **Пользователи**: ${channels}\n<:arrow:766358167382523944> **Каналы:** ${users}`
        },
        link: {
            title: () => `**Ссылки**`,
            content: () => `<:arrow:766358167382523944> **Сервер поддержки:** [Нажмите](${discord})\n<:arrow:766358167382523944> **Приглашение:** [Нажмите](https://discordapp.com/api/oauth2/authorize?client_id=577236734245470228&permissions=8&scope=bot)`
        }
    },

    credits: {
        title: () => `**InviteCount**`,
        content: () => `InviteCount позволяет вам управлять членами вашего сервера, отслеживая их приглашения.`,

        dev: {
            title: () => `**Разработчики :**`,
            content: (uptime) => `[Npg](https://github.com/ThisDudeBoy)\n[Alex](https://discord.com)\n[Alboom](https://discord.com)`
        },
        statistics: {
            title: () => `**Вдохновлено :**`,
            content: (guilds, users, channels, ping, ram, shardID) => `[ManageInvite](https://github.com/ManageInvite/ManageInvite)\n[InviteManager](https://github.com/SideProjectGuys/invite-manager-bot)`
        },
        link: {
            title: () => `**Особая благодарность :**`,
            content: () => `⭐ **Androz** за помощь с ManageInvite!\n🎁 **Pauldb09** за систему раздачи\n👨‍🏭 Вся команда & Переводчики`
        }
    },

    invite: {
        description: (member, memberData, isYou, nextRank, role) => `${isYou ? `У вас` : `У **${member.user.username}**`} есть **${memberData.invites + memberData.bonus - memberData.leaves - memberData.fake}** приглашений! (**${memberData.invites}** обычных, **${memberData.bonus}** бонусных, **${memberData.fake > 0 ? `-${memberData.fake}` : `${memberData.fake}`}** поддельных, **${memberData.leaves > 0 ? `-${memberData.leaves}` : `${memberData.leaves}`}** уходов)${nextRank ? `\nВам нужно **${Math.round(nextRank.inviteCount - (memberData.invites + memberData.bonus - memberData.leaves - memberData.fake))}** ещё приглашений, чтобы получить следующий ранг: **${role}**!` : ""}`
    },

    inviter: {
        description: (member, inviterName) => `**${member.user.username}** was invited by **${inviterName}**`,
        unknown: () => `Unknown`,
        notFound: () => `Inviter not found (user may have been deleted)`
    },
    leaderboard: {
        cleared: () => `${emojis.success} | Таблица лидеров очищена!`,
        user: (user, member, lb) => `${lb} **${user.username}** - **${member.calculatedInvites}** приглашений (**${member.invites}** обычных, **${member.bonus}** бонусных, **${member.fake > 0 ? `-${member.fake}` : `${member.fake}`}** поддельных, **${member.leaves > 0 ? `-${member.leaves}` : `${member.leaves}`}** уходов)`,
        prompt: () => `{{user}}, на какую страницу вы хотите перейти? Напишите \`cancel\` или \`0\` для отмены.`,
        title: () => `Таблица лидеров приглашений`,
        empty: {
            title: () => `😕 Приглашения не найдены`,
            content: () => `Начните приглашать людей и вы появитесь на этой странице!`
        }
    },

    userinfo: {
        title: (user) => `${user.tag} аккаунт (${user.id})`,
        fields: {
            // user
            createdAt: {
                title: () => `<:createdAt:741247823269593118> Создание`
            },
            bot: {
                title: () => `<:maestro_robot:749985600110723184> Бот`,
                content: (user) => user.bot ? "Да" : "Нет"
            },
            // member
            joinedAt: {
                title: () => `<:join:741252065585660014> Присоединение`
            },
            joinWay: {
                title: () => `Способ присоединения`,
                oauth: () => `OAuth приглашение (через discordapp.com).`,
                vanity: () => `Пользовательское приглашение, настроенное администратором.`,
                unknown: (user) => `Я не могу понять, как ${user.username} присоединился к серверу.`,
                invite: (user) => user.tag
            },
            invites: {
                title: () => `✉️ Приглашения`,
                content: (inviteData) => `**${inviteData.invites + inviteData.bonus - inviteData.leaves - inviteData.fake}** приглашений (**${inviteData.invites}** обычных, **${inviteData.bonus}** бонусных, **${inviteData.fake > 0 ? `-${inviteData.fake}` : `${inviteData.fake}`}** поддельных, **${inviteData.leaves > 0 ? `-${inviteData.leaves}` : `${inviteData.leaves}`}** уходов)`
            },
            joinOrder: {
                title: () => `➡️ Порядок присоединения`,
                content: (previous, next, user) => `${previous ? `**${previous.tag}** > ` : ""}**${user.tag}**${next ? ` > **${next.tag}**` : ""}`
            }
        }
    },

    kick: {
        errors:{
            missingPerms: "<:error:753232040199192657> | Вы должны иметь разрешение `KICK_MEMBERS`",
            nouser: "<:error:753232040199192657> | Пожалуйста, упомяните пользователя",
            supperior: "<:error:753232040199192657> | Вы не можете исключить пользователя, превосходящего вас",
            noperm: "<:error:753232040199192657> | Произошла ошибка... Пожалуйста, проверьте, что у меня есть разрешение на исключение этого участника, и повторите попытку!",
            
        },
        description: "<:success:753232040073101363> | Пользователь успешно исключен",
        banneddm: (server, moderator, reason) => "Вас исключили из **" + server + "** пользователем **" + moderator + "**\n**Причина** : `" + reason + "`" 
    },

    ban: {
        errors:{
            missingPerms: "<:error:753232040199192657> | Вы должны иметь разрешение `BAN_MEMBERS`",
            nouser: "<:error:753232040199192657> | Пожалуйста, упомяните пользователя",
            supperior: "<:error:753232040199192657> | Вы не можете заблокировать пользователя, превосходящего вас",
            noperm: "<:error:753232040199192657> | Произошла ошибка... Пожалуйста, проверьте, что у меня есть разрешение на блокировку этого участника, и повторите попытку!",
            
        },
        description: "<:success:753232040073101363> | Пользователь успешно заблокирован",
        banneddm: (server, moderator, reason) => "Вас заблокировали на **" + server + "** пользователем **" + moderator + "**\n**Причина** : `" + reason + "`" 
    },

    unban: {
        noid: "<:error:753232040199192657> | Пожалуйста, укажите идентификатор для разблокировки",
        success: (user) => "<:success:753232040073101363> | " + user + " успешно разблокирован",
        noban: "<:error:753232040199192657> | Этот пользователь не заблокирован"
    },

    membercount: {
        title: (guildName) => `Количество участников ${guildName}`,
        description: (guild) => `
        Всего **${guild.members.cache.size}** участников (**${guild.members.cache.filter((m) => !m.user.bot).size}** людей и **${guild.members.cache.filter((m) => m.user.bot).size}** ботов)

        ➔ ${emojis.dnd} | ${guild.members.cache.filter((m) => m.presence.status === "dnd"  && !m.user.bot).size} участников (не беспокоить)
        ➔ ${emojis.online} | ${guild.members.cache.filter((m) => m.presence.status === "online" && !m.user.bot).size} участников (онлайн)
        ➔ ${emojis.idle} | ${guild.members.cache.filter((m) => m.presence.status === "idle" && !m.user.bot).size} участников (неактивен)
        ➔ ${emojis.offline} | ${guild.members.cache.filter((m) => m.presence.status === "offline" && !m.user.bot).size} участников (офлайн)`
    },

    addbonus: {
        errors: {
            bonus: {
                missing: (prefix) => `${emojis.error} | Вы должны указать количество бонусных приглашений, которые вы хотите добавить. (Синтаксис: ${prefix}addbonus количество @участник) **Вам нужно пригласить реального человека, чтобы получить награду**`,
                incorrect: (prefix) => `${emojis.error} | Вы должны указать __**действительное**__ количество бонусных приглашений. (Синтаксис: ${prefix}addbonus количество @участник)`
            },
            member: {
                missing: (prefix) => `${emojis.error} | Вы должны упомянуть участника, которому хотите добавить бонусные приглашения. (Синтаксис: ${prefix}addbonus количество @участник)`
            }
        },
        title: () => `📥 Бонусные приглашения добавлены`,
        field: (prefix, member) => `Напишите \`${prefix}invites ${member.user.tag}\`, чтобы увидеть новое количество приглашений **${member.user.username}**!`
    },

    removebonus: {
        errors: {
            bonus: {
                missing: (prefix) => `${emojis.error} | Вы должны указать количество бонусных приглашений, которые вы хотите удалить. (Синтаксис: ${prefix}removebonus количество @участник)`,
                incorrect: (prefix) => `${emojis.error} | Вы должны указать __**действительное**__ количество бонусных приглашений. (Синтаксис: ${prefix}removebonus количество @участник)`
            },
            member: {
                missing: (prefix) => `${emojis.error} | Вы должны упомянуть участника, у которого хотите удалить бонусные приглашения. (Синтаксис: ${prefix}removebonus количество @участник)`
            }
        },
        title: () => `📥 Бонусные приглашения удалены`,
        field: (prefix, member) => `Напишите \`${prefix}invites ${member.user.tag}\`, чтобы увидеть новое количество приглашений **${member.user.username}**!`
    },

    setdmjoin: {
        on: () => `**${emojis.success} | Система DM присоединения теперь __ВКЛЮЧЕНА__!**`,
        off: () => `**${emojis.success} | Система DM присоединения теперь __ОТКЛЮЧЕНА__!**`
    },

    setjoin: {
        on: () => `**${emojis.success} | Система присоединения теперь __ВКЛЮЧЕНА__!**`,
        off: () => `**${emojis.success} | Система присоединения теперь __ОТКЛЮЧЕНА__!**`
    },

    setleave: {
        on: () => `**${emojis.success} | Система уходов теперь __ВКЛЮЧЕНА__!**`,
        off: () => `**${emojis.success} | Система уходов теперь __ОТКЛЮЧЕНА__!**`
    },

    setprefix: {
        missing: () => `${emojis.error} | Вы должны указать префикс!`,
        success: () => `${emojis.success} | Префикс сервера обновлён!`
    },

    testdmjoin: {
        title: () => `:wrench: Система DM присоединения :`,
        description: () => `Если это не работает, проверьте разрешения бота или присоединитесь к нашему [серверу поддержки](${discord})`,
        fields: {
            enabled: () => `> Включено:`,
            message: () => `> Сообщение:`
        },
        enabled: (prefix) => `${emojis.success} Сообщения о присоединении в DM включены. Отключите их с помощью \`${prefix}setdmjoin\`.`,
        disabled: (prefix) =>  `${emojis.error} Сообщения о присоединении в DM отключены. Включите их с помощью \`${prefix}setdmjoin\`.`,
        notDefineds: {
            message: (prefix) => `Сообщение не определено. Установите его с помощью \`${prefix}configdm\`!`
        }
    },

    testjoin: {
        title: () => `:wrench: Система присоединения :`,
        description: () => `Если это не работает, проверьте разрешения бота или присоединитесь к нашему [серверу поддержки](${discord})`,
        fields: {
            enabled: () => `> Включено:`,
            channel: () => `> Канал:`,
            message: () => `> Сообщение:`
        },
        enabled: (prefix) => `${emojis.success} Сообщения о присоединении включены. Отключите их с помощью \`${prefix}setjoin\`.`,
        disabled: (prefix) =>  `${emojis.error} Сообщения о присоединении отключены. Включите их с помощью \`${prefix}setjoin\`.`,
        notDefineds: {
            message: (prefix) => `Сообщение не определено. Установите его с помощью \`${prefix}configjoin\`!`,
            channel: (prefix) => `Канал не определён. Установите его с помощью \`${prefix}configjoin\`!`
        }
    },

    testleave: {
        title: () => `:wrench: Система уходов :`,
        description: () => `Если это не работает, проверьте разрешения бота или присоединитесь к нашему [серверу поддержки](${discord})`,
        fields: {
            enabled: () => `> Включено:`,
            channel: () => `> Канал:`,
            message: () => `> Сообщение:`
        },
        enabled: (prefix) => `${emojis.success} Сообщения об уходе включены. Отключите их с помощью \`${prefix}setleave\`.`,
        disabled: (prefix) =>  `${emojis.error} Сообщения об уходе отключены. Включите их с помощью \`${prefix}setleave\`.`,
        notDefineds: {
            message: (prefix) => `Сообщение не определено. Установите его с помощью \`${prefix}configleave\`!`,
            channel: (prefix) => `Канал не определён. Установите его с помощью \`${prefix}configleave\`!`
        }
    },

    config: {
        title: (guildName) => `Конфигурация ${guildName}`,
        join: {
            title: (enabled) => `${(enabled ? emojis.success : emojis.error)} Сообщения о присоединении`,
            content: (guild, data) => `
            > Включено: ${data.guild.join.enabled ? "**да**" : "**нет**"}
            > Сообщение: ${data.guild.join.message ? "**определено**" : "**не определено**."}
            > Канал: ${!data.guild.join.channel ? "**не определён**" : (guild.channels.cache.get(data.guild.join.channel) ? "**определён**" : "**канал не найден**")}`
        },
        leave: {
            title: (enabled) => `${(enabled ? emojis.success : emojis.error)} Сообщения об уходе`,
            content: (guild, data) => `
            > Включено: ${data.guild.leave.enabled ? "**да**" : "**нет**"}
            > Сообщение: ${data.guild.leave.message ? "**определено**" : "**не определено**."}
            > Канал: ${!data.guild.leave.channel ? "**не определён**" : (guild.channels.cache.get(data.guild.leave.channel) ? "**определён**" : "**канал не найден**")}`
        },
        joinDM: {
            title: (enabled) => `${(enabled ? emojis.success : emojis.error)} Сообщения DM о присоединении`,
            content: (guild, data) => `
            > Включено: ${data.guild.joinDM.enabled ? "**да**" : "**нет**"}
            > Сообщение: ${data.guild.joinDM.message ? "**определено**" : "**не определено**."}`
        },
    },

    joinDM: {
        premium: (username) => `:crown: | Привет, **${username}**! Эта функция доступна только для премиум-серверов и партнёров. Получите премиум: **скоро** !`
    },

    antispam: {
        cooldown: (username) => `Замедлитесь! Пожалуйста, подождите 5 секунд и попробуйте снова!`
    },

    configdmjoin: {
        disable: (prefix) => `Введите \`${prefix}setdmjoin\`, чтобы отключить сообщения о присоединении в DM.`,
        instruct: (str) => `
__**Дополнительная информация**__
\`\`\`
{user} : Упоминание участника, который присоединился к вашему серверу.
{user.name} : Имя участника, который присоединился к вашему серверу.
{user.tag} : Тег участника, который присоединился к вашему серверу.
{user.createdat} : Возраст аккаунта участника.

{guild} : Имя сервера.
{guild.count} : Количество участников вашего сервера на данный момент.

{inviter} : Упоминание пригласившего.
{inviter.name} : Имя пригласившего.
{inviter.tag} : Тег пригласившего.
{inviter.invites} : Общее количество приглашений пригласившего.

{invite.code} : Использованный код приглашения.
{invite.url} : Использованный URL приглашения.
{invite.uses} : Количество использований кода приглашения.
\`\`\`
Введите \`cancel\` для отмены. ${str}


:pencil: **| Теперь напишите сообщение DM о присоединении... :pencil2:**`,
        cancelled: () => `:x: Отменено.`,
        success: () => `✅ **| Успешно выполнено...**`,
        title: () => `**Сообщение DM о присоединении установлено**`,
        fields: {
            message: () => `Сообщение:`,
            testIt: () => `Тестировать:`,
            cmd: (prefix) => `Используйте \`${prefix}testdmjoin\` для тестирования нового сообщения.`
        },

    },

    configjoin: {
        longmessage: () => `<:error:753232040199192657> | Ваше сообщение должно содержать менее 850 символов.`, 
        disable: (prefix) => `Введите \`${prefix}setjoin\`, чтобы отключить сообщения о присоединении.`,
        instructs: {
            message: (str) => `
__**Дополнительная информация**__
\`\`\`
{user} : Упоминание участника, который присоединился к вашему серверу.
{user.name} : Имя участника, который присоединился к вашему серверу.
{user.tag} : Тег участника, который присоединился к вашему серверу.
{user.createdat} : Возраст аккаунта участника.

{guild} : Имя сервера.
{guild.count} : Количество участников вашего сервера на данный момент.

{inviter} : Упоминание пригласившего.
{inviter.name} : Имя пригласившего.
{inviter.tag} : Тег пригласившего.
{inviter.invites} : Общее количество приглашений пригласившего.

{invite.code} : Использованный код приглашения.
{invite.url} : Использованный URL приглашения.
{invite.uses} : Количество использований кода приглашения.
\`\`\`
Введите \`cancel\` для отмены. ${str}


:pencil: **| Теперь напишите сообщение о присоединении... :pencil2:**`,
            channel: () => `:scroll: **| Теперь упомяните канал... :pencil2:**`
        },
        cancelled: () => `:x: Отменено.`,
        success: () => `✅ **| Успешно выполнено...**`,
        title: () => `**Сообщение о присоединении установлено**`,
        fields: {
            message: () => `Сообщение:`,
            channel: () => `Канал:`,
            testIt: () => `Тестировать:`,
            cmd: (prefix) => `Используйте \`${prefix}testjoin\` для тестирования нового сообщения.`
        },
        errors: {
            channelNotFound: (channel) => `${emojis.error} | Канал для \`${channel}\` не найден`
        }
    },

    configleave: {
        disable: (prefix) => `Введите \`${prefix}setleave\`, чтобы отключить сообщения об уходе.`,
        instructs: {
            message: (str) => `
__**Дополнительная информация**__
\`\`\`
{user} : Упоминание участника, который покинул ваш сервер.
{user.name} : Имя участника, который покинул ваш сервер.
{user.tag} : Тег участника, который покинул ваш сервер.
{user.createdat} : Возраст аккаунта участника.

{guild} : Имя сервера.
{guild.count} : Количество участников вашего сервера на данный момент.

{inviter} : Упоминание пригласившего.
{inviter.name} : Имя пригласившего.
{inviter.tag} : Тег пригласившего.
{inviter.invites} : Общее количество приглашений пригласившего.

{invite.code} : Использованный код приглашения.
{invite.url} : Использованный URL приглашения.
{invite.uses} : Количество использований кода приглашения.
\`\`\`
Введите \`cancel\` для отмены. ${str}


:pencil: **| Теперь напишите сообщение об уходе... :pencil2:**`,
            channel: () => `:scroll: **| Теперь упомяните канал... :pencil2:**`
        },
        cancelled: () => `:x: Отменено.`,
        success: () => `✅ **| Успешно выполнено...**`,
        title: () => `**Сообщение об уходе установлено**`,
        fields: {
            message: () => `Сообщение:`,
            channel: () => `Канал:`,
            testIt: () => `Тестировать:`,
            cmd: (prefix) => `Используйте \`${prefix}testleave\` для тестирования нового сообщения`
        },
        errors: {
            channelNotFound: (channel) => `${emojis.error} | Канал для \`${channel}\` не найден`
        }
    },

    setlang: {
        invalid: () => `${emojis.error} | Вы должны указать действительный язык!\n\n:flag_fr: Français (\`fr\`)\n:flag_gb: English (\`en\`)\n:flag_tr: Türkçe (\`tr\`)\n:flag_ru: Русский (\`ru\`)\n:flag_jp: 日本語 (\`jp\`)\n:flag_in: हिंदी (\`hi\`)\n:flag_pt: Português (\`pt\`)\n:flag_br: Português Brasileiro (\`br\`)\n:flag_es: Español (\`es\`)\n:flag_de: Deutsch (\`de\`)\n:flag_it: Italiano (\`it\`)\n:flag_pl: Polski (\`pl\`)\n:flag_nl: Nederlands (\`nl\`)`,
        success: () => `${emojis.success} | :flag_ru: Язык сервера теперь русский!`
    },

    graph: {
        title: (server, days) => `Присоединения на ${server} в последние ${days} дней`,
        content: (total, percent, from, to) => `**${total}** участников (т.е. **${percent}%** сервера) присоединились с ${from} по ${to}:`,
        invalid: () => `Вы должны ввести действительное количество дней (более 1 и менее 1000) для отображения!`,
        months: () =>[
            "Янв",
            "Фев",
            "Мар",
            "Апр",
            "Май",
            "Июн",
            "Июл",
            "Авг",
            "Сен",
            "Окт",
            "Ноя",
            "Дек"
        ],
        
    },

    website: {
        doc: {
            variables: () => `https://invite-count.xyz/configuration/variables`
        },
        utils: {
            members: () => `участников`
        },
        conf: {
            title: () => `Конфигурация`
        },
        selector: {
            title: () => `Выбор`,
            manage: () => `Управление`,
            no: {
                title: () => `Нет сервера`,
                content: () => `Сервер не найден. Пожалуйста, проверьте, что вы авторизованы правильной учётной записью.`
            }
        },
        help: {
            title: () => `Помощь`,
            doc: () => `Документация`,
            support: () => `Сервер поддержки`
        },
        forms: {
            buttons: {
                enable: () => `Включить сообщения`,
                disable: () => `Отключить сообщения`,
                update: () => `Обновить сообщения`
            },
            basic: {
                title: () => `Основная конфигурация`,
                language: () => `Язык`,
                prefix: () => `Префикс`,
                update: () => `Обновить`
            },
            join: {
                title: () => `Сообщения о присоединении`,
                message: {
                    title: () => `Сообщение`,
                    default: () => `{user} присоединился к серверу! Пригласил **{inviter.tag}** (у которого **{inviter.invites}** приглашений).`
                },
                channel: {
                    title: () => `Канал`
                },
            },
            leave: {
                title: () => `Сообщения об уходе`,
                message: {
                    title: () => `Сообщение`,
                    default: () => `{user.username} покинул сервер. Пригласил **{inviter.tag}** (у которого **{inviter.invites}** приглашений).`
                },
                channel: {
                    title: () => `Канал`
                }
            },
            joinDM: {
                title: () => `Сообщения DM о присоединении`,
                premium: () => `Функция доступна для премиум-серверов и партнёров.`,
                message: {
                    title: () => `Сообщение`,
                    default: () => `Добро пожаловать {user}! Вы присоединились к **{server}**! Вас пригласил **{inviter.tag}**. Не забудьте прочитать правила сервера!`,
                }
            }
        }
    },

    removeinvites: {
        loading: {
            all: (prefix) => `${emojis.loading} | Процесс удаления приглашений сервера начался... Вы можете восстановить их с помощью команды \`${prefix}restore-invites\`!`,
            member: (prefix, member) => `${emojis.loading} | Процесс удаления приглашений **${member.user.tag}}** начался... Вы можете восстановить их с помощью команды \`${prefix}restore-invites ${member.user.tag}\` !`
        },
        title: () => `☄️ Приглашения переустановлены`,
        titles: {
            all: (prefix) => `${emojis.success} | Приглашения сервера переустановлены! Вы можете восстановить их с помощью команды \`${prefix}restore-invites\`!`,
            member: (prefix, member) => `${emojis.success} | Приглашения **${member.user.tag}}** переустановлены! Вы можете восстановить их с помощью команды \`${prefix}restore-invites ${member.user.tag}\`!`
        }
    },

    restoreinvites: {
        confirmations: {
            all: (prefix, memberCount) => `${emojis.warn} | Вы уверены, что хотите восстановить приглашения сервера? Все участники получат приглашения, которые были до последнего выполнения команды \`${prefix}remove-invites\` (или 0, если команда никогда не была выполнена).\n\n:information_source: **Обзор приглашений**:\nБудет восстановлено всего: **${memberCount.invites}** обычных, **${memberCount.bonus}** бонусных, **${memberCount.leaves}** уходов, **${memberCount.fake}** поддельных.\n\n${emojis.success} Введите \`-confirm\` для подтверждения.\n${emojis.error} Введите \`cancel\` для отмены.`,
            member: (prefix, member) => `${emojis.warn} | Вы уверены, что хотите восстановить приглашения **${member.user.tag}}**? Они получат приглашения, которые были до последнего выполнения команды \`${prefix}remove-invites\` (или 0, если команда никогда не была выполнена).\n\n:information_source: **Обзор приглашений**:\nБудет восстановлено: **${member.data.old_invites}** обычных, **${member.data.old_bonus}** бонусных, **${member.data.old_leaves}** уходов, **${member.data.old_fake}** поддельных.\n\n${emojis.success} Введите \`-confirm\` для подтверждения.\n${emojis.error} Введите \`cancel\` для отмены.`,
            cancelled: () => `${emojis.error} Отменено.`
        },
        loading: {
            all: () => `${emojis.loading} | Процесс восстановления приглашений сервера начался....`,
            member: (member) => `${emojis.loading} | Процесс восстановления приглашений **${member.user.tag}}** начался...`
        },
        title: () => `☄️ Приглашения восстановлены`,
        titles: {
            all: () => `${emojis.success} | Приглашения сервера восстановлены!`,
            member: (member) => `${emojis.success} | Приглашения **${member.user.tag}}** восстановлены!`
        }
    },

    syncinvites: {
        no: () => `${emojis.error} | Нет приглашений для синхронизации.`,
        confirmations: {
            all: (inviteCount) => `${emojis.warn} | Вы уверены, что хотите синхронизировать приглашения сервера?\n\n:information_source: **Обзор приглашений**:\nБудет восстановлено **${Math.round(inviteCount)}** обычных приглашений.\n\n${emojis.success} Введите \`-confirm\` для подтверждения.\n${emojis.error} Введите \`cancel\` для отмены.`,
            cancelled: () => `${emojis.error} Отменено.`
        },
        title: () => `☄️ Приглашения синхронизированы`,
        titles: {
            all: () => `${emojis.success} | Приглашения сервера синхронизированы!`
        }
    },

    add: {
        content: (id) => `Вы можете добавить меня на свой сервер, нажав [здесь](https://discordapp.com/oauth2/authorize?client_id=${id}&scope=bot&permissions=2146958847).`,
        requested: (username) => `Запрошено ${username}`
    },

    support: {
        content: (id) => `Вы можете присоединиться к нашему серверу поддержки, нажав [здесь](https://discord.gg/f7f2P2q).`,
        requested: (username) => `Запрошено ${username}`
    }

};
