const { emojis, discord } = require("../config");

module.exports = {

    locale: "sr_RS",

    utils: {
        prefix: (prefix) => `Мој тренутни префикс је \`${prefix}\`\nКористите \`${prefix}help\` за више информација.`,
        viewConf: () => `[Погледајте конфигурацију на контролној табли](https://invite-count.xyz)`,
        conf: {
            title: () => `Погледајте конфигурацију на контролној табли`,
            content: () => `[или на контролној табли](https://invite-count.xyz)`
        },
        specialMessages: {
            join: {
                oauth2: (user) => `${user} се придружио серверу путем OAuth-а.`,
                
                vanity: (user) => `${user} се придружио серверу путем discord.gg позива који је поставио власник сервера.`,
                unknown: (user) => `Не могу да разумем како се ${user} придружио серверу.`,
                perm: (user) => `${emojis.error} | Мне су потребне дозволе за управљање сервером да бих знао ко је позвао ${user}.`
            },
            leave: {
                oauth2: (user) => `${user} је напустио сервер, придружио се путем OAuth-а.`,
                vanity: (user) => `${user} је напустио сервер, придружио се путем discord.gg позива који је поставио власник сервера.`,
                unknown: (user) => `${user} је напустио сервер, али не могу да разумем како се придружио.`
            }
        }
    },

    errors: {
        missingPerms: (neededPermissions) => `__**${emojis.error} Недостају дозволе**__\n\nМне су потребне следеће дозволе да би ова команда правилно функционисала: ${neededPermissions.map((p) => "`"+p+"`").join(", ")}`,
        disabled: () => `${emojis.error} | Ова команда је тренутно онемогућена!`,
        permLevel: (name) => `${emojis.error} | Ова команда захтева ниво дозволе: \`${name}\`!`,
        sendPerm: () => `${emojis.error} | Немам дозволу да шаљем поруке на овај канал.`,
        missingAdmin: () => `${emojis.error} | Мне је потребна дозвола \`Управљање сервером\` да извршим ову акцију`
    },
    glogs: {
        err: () => `<:error:851490719934840872> | Тренутни канал је већ овај канал!`,
        success: () => `<:succes:851491428563812382> | Канал дневника је успешно постављен.`
    },
    glist: {
        title: () => `🎁 Листа награда`,
        description: (prefix) => `Користите \`${prefix}gstart\` да почнете награду. Приказане су само недовршене награде`,
        fields: {
            name: () => `> Листа`,
            message: (gs) => `${gs.map(ginfos=>`<:channel:851482936787730472> [${ginfos.prize}](${ginfos.messageURL}) : Завршава ${ginfos.endAt}`).join("\n")} `
        },
        err: () => `<:error:851490719934840872> | На овом серверу нема недовршених награда`,

    },
    help: {
        title: () => `ℹ InviteCount страница за помоћ`,
        description: (guildName, prefix) => `InviteCount вам омогућава управљање члановима сервера праћењем позива.\n\n**Документација** је доступна [овде](https://docs.invite-count.xyz/).`,
        moderation: {
            title: () => `🛡️ **Модерирање**`,
            content: (prefix) => "> `ban`, `kick`, `unban`"},
        admin: {
            title: () => `⚙️ **Администрација**`,
            content: (prefix) => "> `addbonus`, `removebonus`, `sync-invites`, `removeinvites`, `restoreinvites`, `setprefix`, `setlang`, `config`"},
        joinDM: {
            title: () => `💻 **Опште**`,
            content: (prefix) => "> `infos`, `add`, `membercount`, `userinfo`, `support`, `credits`, `invites`, `leaderboard`"},
        join: {
            title: () => `:tools: **Конфигурација**`,
            content: (prefix) => "> `configjoin`, `setjoin`, `testjoin`, `configleave`, `setleave`, `testleave`, `configdm`, `setdm`, `testdm`"},
        leave: {
            title: () => `:envelope: Поруке за напуштање`,
            content: (prefix) => "`configleave`, `setleave`, `testleave`"},
        giveaway: {
            title: () => `🎁 **Награде**`,
            content: (prefix) => "> `gstart`, `gend`, `glist`, `glogs`, `greroll`"},
        invites: {
            title: () => `:wave: Позиви`,
            content: (prefix) => "`invite`, `leaderboard`"},
        manageInvite: {
            title: () => `💠 Алатке`,
            content: (prefix) => "`membercount`, `userinfo`, `botinfos`, `ping`, `creators`, `support`, `credits`, `add`"},
        tip: (prefix) => `🔗 Линкови :`,
        links: (clientID) => `[Додајте ме](https://discordapp.com/api/oauth2/authorize?client_id=${clientID}&permissions=8&scope=bot) ● [Веб сајт](https://invite-count.xyz) ● [Сервер подршке](${discord}) ● [Гласајте за ме](https://discord.boats/bot/${clientID}/vote)`
    },

    infos: {
        title: () => `**InviteCount**`,
        content: () => `InviteCount вам омогућава управљање члановима сервера праћењем позива.`,

        dev: {
            title: () => `**Информације**`,
            content: (uptime) => `<:arrow:766358167382523944> **Програмери:** Npg, Alex, Alboom\n <:arrow:766358167382523944> **Библиотека:** [discord.js v14.14.1](https://discord.js.org/#/)\n <:arrow:766358167382523944> **Време рада** ${uptime}\n <:arrow:766358167382523944> **Датум стварања:** 12. мај 2019.`
        },
        statistics: {
            title: () => `**Статистика**`,
            content: (guilds, users, channels, ping, ram, shardID) => `<:arrow:766358167382523944> **Сервери:** ${guilds}\n<:arrow:766358167382523944> **Корисници**: ${channels}\n<:arrow:766358167382523944> **Канали:** ${users}`
        },
        link: {
            title: () => `**Линкови**`,
            content: () => `<:arrow:766358167382523944> **Сервер подршке:** [Кликните](${discord})\n<:arrow:766358167382523944> **Позив:** [Кликните](https://discordapp.com/api/oauth2/authorize?client_id=577236734245470228&permissions=8&scope=bot)`
        }
    },

    credits: {
        title: () => `**InviteCount**`,
        content: () => `InviteCount вам омогућава управљање члановима сервера праћењем позива.`,

        dev: {
            title: () => `**Програмери :**`,
            content: (uptime) => `[Npg](https://github.com/ThisDudeBoy)\n[Alex](https://discord.com)\n[Alboom](https://discord.com)`
        },
        statistics: {
            title: () => `**Инспирисано :**`,
            content: (guilds, users, channels, ping, ram, shardID) => `[ManageInvite](https://github.com/ManageInvite/ManageInvite)\n[InviteManager](https://github.com/SideProjectGuys/invite-manager-bot)`
        },
        link: {
            title: () => `**Посебна хвала :**`,
            content: () => `⭐ **Androz** за помоћ са ManageInvite!\n🎁 **Pauldb09** за систем наградног извлачења\n👨‍🏭 Цели тим & Преводиоци`
        }
    },

    invite: {
        description: (member, memberData, isYou, nextRank, role) => `${isYou ? `Имате` : `**${member.user.username}** има`} **${memberData.invites + memberData.bonus - memberData.leaves - memberData.fake}** позива! (**${memberData.invites}** нормалних, **${memberData.bonus}** бонус, **${memberData.fake > 0 ? `-${memberData.fake}` : `${memberData.fake}`}** лажних, **${memberData.leaves > 0 ? `-${memberData.leaves}` : `${memberData.leaves}`}** одласка)${nextRank ? `\nПотребно вам је **${Math.round(nextRank.inviteCount - (memberData.invites + memberData.bonus - memberData.leaves - memberData.fake))}** више позива да достигнете следећи ранг: **${role}**!` : ""}`
    },

    inviter: {
        description: (member, inviterName) => `**${member.user.username}** was invited by **${inviterName}**`,
        unknown: () => `Unknown`,
        notFound: () => `Inviter not found (user may have been deleted)`
    },
    leaderboard: {
        cleared: () => `${emojis.success} | Листа рангова избрисана!`,
        user: (user, member, lb) => `${lb} **${user.username}** - **${member.calculatedInvites}** позива (**${member.invites}** нормалних, **${member.bonus}** бонус, **${member.fake > 0 ? `-${member.fake}` : `${member.fake}`}** лажних, **${member.leaves > 0 ? `-${member.leaves}` : `${member.leaves}`}** одласка)`,
        prompt: () => `{{user}}, на коју страницу желите да идете? Унесите \`cancel\` или \`0\` да отказате.`,
        title: () => `Листа рангова позива`,
        empty: {
            title: () => `😕 Позиви нису пронађени`,
            content: () => `Почните да позивате људе и појавићете се на овој страници!`
        }
    },

    userinfo: {
        title: (user) => `${user.tag} налог (${user.id})`,
        fields: {
            createdAt: {
                title: () => `<:createdAt:741247823269593118> Направљено`
            },
            bot: {
                title: () => `<:maestro_robot:749985600110723184> Бот`,
                content: (user) => user.bot ? "Да" : "Не"
            },
            joinedAt: {
                title: () => `<:join:741252065585660014> Придружено`
            },
            joinWay: {
                title: () => `Начин придруживања`,
                oauth: () => `OAuth позив (путем discordapp.com).`,
                vanity: () => `Прилагођени позив који је поставио администратор.`,
                unknown: (user) => `Не могу да разумем како се корисник ${user.username} придружио серверу.`,
                invite: (user) => user.tag
            },
            invites: {
                title: () => `✉️ Позиви`,
                content: (inviteData) => `**${inviteData.invites + inviteData.bonus - inviteData.leaves - inviteData.fake}** позива (**${inviteData.invites}** нормалних, **${inviteData.bonus}** бонус, **${inviteData.fake > 0 ? `-${inviteData.fake}` : `${inviteData.fake}`}** лажних, **${inviteData.leaves > 0 ? `-${inviteData.leaves}` : `${inviteData.leaves}`}** одласка)`
            },
            joinOrder: {
                title: () => `➡️ Редослед придруживања`,
                content: (previous, next, user) => `${previous ? `**${previous.tag}** > ` : ""}**${user.tag}**${next ? ` > **${next.tag}**` : ""}`
            }
        }
    },

    kick: {
        errors:{
            missingPerms: "<:error:753232040199192657> | Морате имати дозволу `KICK_MEMBERS`",
            nouser: "<:error:753232040199192657> | Молим вас да споменете корисника",
            supperior: "<:error:753232040199192657> | Не можете избацити корисника који је изнад вас",
            noperm: "<:error:753232040199192657> | Дошло је до грешке... Молимо вас да проверите да ли имам дозволу да избацим овог члана и покушајте поново!",
            
        },
        description: "<:success:753232040073101363> | Корисник избачен.",
        banneddm: (server, moderator, reason) => "Избачени сте са **" + server + "** од стране **" + moderator + "**\n**Разлог** : `" + reason + "`" 
    },

    ban: {
        errors:{
            missingPerms: "<:error:753232040199192657> | Морате имати дозволу `BAN_MEMBERS`",
            nouser: "<:error:753232040199192657> | Молим вас да споменете корисника",
            supperior: "<:error:753232040199192657> | Не можете забранити корисника који је изнад вас",
            noperm: "<:error:753232040199192657> | Дошло је до грешке... Молимо вас да проверите да ли имам дозволу да забраним овог члана и покушајте поново!",
            
        },
        description: "<:success:753232040073101363> | Корисник забрањен.",
        banneddm: (server, moderator, reason) => "Забрањени сте на **" + server + "** од стране **" + moderator + "**\n**Разлог** : `" + reason + "`" 
    },

    unban: {
        noid: "<:error:753232040199192657> | Молимо дајте ID за уклањање забране",
        success: (user) => "<:success:753232040073101363> | " + user + " успешно није забрањен",
        noban: "<:error:753232040199192657> | Овај корисник није забрањен"
    },

    membercount: {
        title: (guildName) => `Број чланова ${guildName}`,
        description: (guild) => `
        Укупно **${guild.members.cache.size}** чланова (**${guild.members.cache.filter((m) => !m.user.bot).size}** људи и **${guild.members.cache.filter((m) => m.user.bot).size}** ботова)

        ➔ ${emojis.dnd} | ${guild.members.cache.filter((m) => m.presence.status === "dnd"  && !m.user.bot).size} чланова (не сметај)
        ➔ ${emojis.online} | ${guild.members.cache.filter((m) => m.presence.status === "online" && !m.user.bot).size} чланова (активан)
        ➔ ${emojis.idle} | ${guild.members.cache.filter((m) => m.presence.status === "idle" && !m.user.bot).size} чланова (неактиван)
        ➔ ${emojis.offline} | ${guild.members.cache.filter((m) => m.presence.status === "offline" && !m.user.bot).size} чланова (офлајн)`
    },

    addbonus: {
        errors: {
            bonus: {
                missing: (prefix) => `${emojis.error} | Морате навести број бонус позива за додавање. (Синтакса: ${prefix}addbonus број @члан) **Морате позвати праву особу да бисте добили награду**`,
                incorrect: (prefix) => `${emojis.error} | Морате навести важећи број бонус позива за додавање. (Синтакса: ${prefix}addbonus број @члан)`
            },
            member: {
                missing: (prefix) => `${emojis.error} | Морате споменути члана да додате бонус позиве. (Синтакса: ${prefix}addbonus број @члан)`
            }
        },
        title: () => `📥 Бонус позиви додани`,
        field: (prefix, member) => `Унесите \`${prefix}invites ${member.user.tag}\` да видите нови број позива за **${member.user.username}**!`
    },

    removebonus: {
        errors: {
            bonus: {
                missing: (prefix) => `${emojis.error} | Морате навести број бонус позива за уклањање. (Синтакса: ${prefix}removebonus број @члан)`,
                incorrect: (prefix) => `${emojis.error} | Морате навести важећи број бонус позива за уклањање. (Синтакса: ${prefix}removebonus број @члан)`
            },
            member: {
                missing: (prefix) => `${emojis.error} | Морате споменути члана да уклоните бонус позиве. (Синтакса: ${prefix}removebonus број @члан)`
            }
        },
        title: () => `📥 Бонус позиви уклоњени`,
        field: (prefix, member) => `Унесите \`${prefix}invites ${member.user.tag}\` да видите нови број позива за **${member.user.username}**!`
    },

    setdmjoin: {
        on: () => `**${emojis.success} | Систем DM придруживања је сада __ОМОГУЋЕН__!**`,
        off: () => `**${emojis.success} | Систем DM придруживања је сада __ОНЕМОГУЋЕН__!**`
    },

    setjoin: {
        on: () => `**${emojis.success} | Систем придруживања је сада __ОМОГУЋЕН__!**`,
        off: () => `**${emojis.success} | Систем придруживања је сада __ОНЕМОГУЋЕН__!**`
    },

    setleave: {
        on: () => `**${emojis.success} | Систем напуштања је сада __ОМОГУЋЕН__!**`,
        off: () => `**${emojis.success} | Систем напуштања је сада __ОНЕМОГУЋЕН__!**`
    },

    setprefix: {
        missing: () => `${emojis.error} | Морате навести префикс!`,
        success: () => `${emojis.success} | Префикс сервера је успешно ажуриран!`
    },

    testdmjoin: {
        title: () => `:wrench: Систем DM придруживања :`,
        description: () => `Ако ово не функционише, проверите дозволе бота или се придружите [серверу подршке](${discord})`,
        fields: {
            enabled: () => `> Омогућено:`,
            message: () => `> Порука:`
        },
        enabled: (prefix) => `${emojis.success} DM поруке придруживања су омогућене. Онемогућите са \`${prefix}setdmjoin\`.`,
        disabled: (prefix) =>  `${emojis.error} DM поруке придруживања су онемогућене. Омогућите са \`${prefix}setdmjoin\`.`,
        notDefineds: {
            message: (prefix) => `Порука није дефинисана. Поставите са \`${prefix}configdm\`!`
        }
    },

    testjoin: {
        title: () => `:wrench: Систем придруживања :`,
        description: () => `Ако ово не функционише, проверите дозволе бота или се придружите [серверу подршке](${discord})`,
        fields: {
            enabled: () => `> Омогућено:`,
            channel: () => `> Канал:`,
            message: () => `> Порука:`
        },
        enabled: (prefix) => `${emojis.success} Поруке придруживања су омогућене. Онемогућите са \`${prefix}setjoin\`.`,
        disabled: (prefix) =>  `${emojis.error} Поруке придруживања су онемогућене. Омогућите са \`${prefix}setjoin\`.`,
        notDefineds: {
            message: (prefix) => `Порука није дефинисана. Поставите са \`${prefix}configjoin\`!`,
            channel: (prefix) => `Канал није дефинисан. Поставите са \`${prefix}configjoin\`!`
        }
    },

    testleave: {
        title: () => `:wrench: Систем напуштања :`,
        description: () => `Ако ово не функционише, проверите дозволе бота или се придружите [серверу подршке](${discord})`,
        fields: {
            enabled: () => `> Омогућено:`,
            channel: () => `> Канал:`,
            message: () => `> Порука:`
        },
        enabled: (prefix) => `${emojis.success} Поруке напуштања су омогућене. Онемогућите са \`${prefix}setleave\`.`,
        disabled: (prefix) =>  `${emojis.error} Поруке напуштања су онемогућене. Омогућите са \`${prefix}setleave\`.`,
        notDefineds: {
            message: (prefix) => `Порука није дефинисана. Поставите са \`${prefix}configleave\`!`,
            channel: (prefix) => `Канал није дефинисан. Поставите са \`${prefix}configleave\`!`
        }
    },

    config: {
        title: (guildName) => `Конфигурација ${guildName}`,
        join: {
            title: (enabled) => `${(enabled ? emojis.success : emojis.error)} Поруке придруживања`,
            content: (guild, data) => `
            > Омогућено: ${data.guild.join.enabled ? "**да**" : "**не**"}
            > Порука: ${data.guild.join.message ? "**постављена**" : "**није постављена**."}
            > Канал: ${!data.guild.join.channel ? "**није постављен**" : (guild.channels.cache.get(data.guild.join.channel) ? "**постављен**" : "**канал није пронађен**")}`
        },
        leave: {
            title: (enabled) => `${(enabled ? emojis.success : emojis.error)} Поруке напуштања`,
            content: (guild, data) => `
            > Омогућено: ${data.guild.leave.enabled ? "**да**" : "**не**"}
            > Порука: ${data.guild.leave.message ? "**постављена**" : "**није постављена**."}
            > Канал: ${!data.guild.leave.channel ? "**није постављен**" : (guild.channels.cache.get(data.guild.leave.channel) ? "**постављен**" : "**канал није пронађен**")}`
        },
        joinDM: {
            title: (enabled) => `${(enabled ? emojis.success : emojis.error)} DM поруке придруживања`,
            content: (guild, data) => `
            > Омогућено: ${data.guild.joinDM.enabled ? "**да**" : "**не**"}
            > Порука: ${data.guild.joinDM.message ? "**постављена**" : "**није постављена**."}`
        },
    },

    joinDM: {
        premium: (username) => `:crown: | Здраво, **${username}**! Ова функција је доступна само за премијум и партнерске сервере. Добијте премијум: **ускоро** !`
    },

    antispam: {
        cooldown: (username) => `Успори! Молимо вас да чекате 5 секунди и покушајте поново!`
    },

    configdmjoin: {
        disable: (prefix) => `Унесите \`${prefix}setdmjoin\` да онемогућите DM поруке придруживања.`,
        instruct: (str) => `
__**Додатне информације**__
\`\`\`
{user} : Спомињање члана који се придружио серверу.
{user.name} : Име члана који се придружио серверу.
{user.tag} : Означена члана која се придружила серверу.
{user.createdat} : Старост налога члана.

{guild} : Назив сервера.
{guild.count} : Тренутни број чланова на вашем серверу.

{inviter} : Спомињање позиваоца.
{inviter.name} : Име позиваоца.
{inviter.tag} : Означена позиваоца.
{inviter.invites} : Укупан број позива позиваоца.

{invite.code} : Коришћени код позива.
{invite.url} : Коришћени УРЛ позива.
{invite.uses} : Колико пута је коришћен код позива.
\`\`\`
Унесите \`cancel\` да отказате. ${str}


:pencil: **| Сада унесите DM поруку придруживања... :pencil2:**`,
        cancelled: () => `:x: Отказано.`,
        success: () => `✅ **| Готово..**`,
        title: () => `**DM порука придруживања постављена**`,
        fields: {
            message: () => `Порука:`,
            testIt: () => `Тест:`,
            cmd: (prefix) => `Користите \`${prefix}testdmjoin\` да тестирате нову поруку.`
        },

    },

    configjoin: {
        longmessage: () => `<:error:753232040199192657> | Ваша порука мора бити мања од 850 карактера.`, 
        disable: (prefix) => `Унесите \`${prefix}setjoin\` да онемогућите поруке придруживања.`,
        instructs: {
            message: (str) => `
__**Додатне информације**__
\`\`\`
{user} : Спомињање члана који се придружио серверу.
{user.name} : Име члана који се придружио серверу.
{user.tag} : Означена члана која се придружила серверу.
{user.createdat} : Старост налога члана.

{guild} : Назив сервера.
{guild.count} : Тренутни број чланова на вашем серверу.

{inviter} : Спомињање позиваоца.
{inviter.name} : Име позиваоца.
{inviter.tag} : Означена позиваоца.
{inviter.invites} : Укупан број позива позиваоца.

{invite.code} : Коришћени код позива.
{invite.url} : Коришћени УРЛ позива.
{invite.uses} : Колико пута је коришћен код позива.
\`\`\`
Унесите \`cancel\` да отказате. ${str}


:pencil: **| Сада унесите поруку придруживања... :pencil2:**`,
            channel: () => `:scroll: **| Сада наведите канал... :pencil2:**`
        },
        cancelled: () => `:x: Отказано.`,
        success: () => `✅ **| Готово..**`,
        title: () => `**Порука придруживања постављена**`,
        fields: {
            message: () => `Порука:`,
            channel: () => `Канал:`,
            testIt: () => `Тест:`,
            cmd: (prefix) => `Користите \`${prefix}testjoin\` да тестирате нову поруку.`
        },
        errors: {
            channelNotFound: (channel) => `${emojis.error} | Нисам пронашао канал за \`${channel}\``
        }
    },

    configleave: {
        disable: (prefix) => `Унесите \`${prefix}setleave\` да онемогућите поруке напуштања.`,
        instructs: {
            message: (str) => `
__**Додатне информације**__
\`\`\`
{user} : Спомињање члана који је напустио сервер.
{user.name} : Име члана који је напустио сервер.
{user.tag} : Означена члана која је напустила сервер.
{user.createdat} : Старост налога члана.

{guild} : Назив сервера.
{guild.count} : Тренутни број чланова на вашем серверу.

{inviter} : Спомињање позиваоца.
{inviter.name} : Име позиваоца.
{inviter.tag} : Означена позиваоца.
{inviter.invites} : Укупан број позива позиваоца.

{invite.code} : Коришћени код позива.
{invite.url} : Коришћени УРЛ позива.
{invite.uses} : Колико пута је коришћен код позива.
\`\`\`
Унесите \`cancel\` да отказате. ${str}


:pencil: **| Сада унесите поруку напуштања... :pencil2:**`,
            channel: () => `:scroll: **| Сада наведите канал... :pencil2:**`
        },
        cancelled: () => `:x: Отказано.`,
        success: () => `✅ **| Готово..**`,
        title: () => `**Порука напуштања постављена**`,
        fields: {
            message: () => `Порука:`,
            channel: () => `Канал:`,
            testIt: () => `Тест:`,
            cmd: (prefix) => `Користите \`${prefix}testleave\` да тестирате нову поруку`
        },
        errors: {
            channelNotFound: (channel) => `${emojis.error} | Нисам пронашао канал за \`${channel}\``
        }
    },

    setlang: {
        invalid: () => `${emojis.error} | Морате навести важећи језик!\n\n:flag_fr: Français (\`fr\`)\n:flag_gb: English (\`en\`)\n:flag_tr: Türkçe (\`tr\`)\n:flag_ru: Русский (\`ru\`)\n:flag_jp: 日本語 (\`jp\`)\n:flag_in: हिंदी (\`hi\`)\n:flag_pt: Português (\`pt\`)\n:flag_br: Português Brasileiro (\`br\`)\n:flag_es: Español (\`es\`)\n:flag_de: Deutsch (\`de\`)\n:flag_it: Italiano (\`it\`)\n:flag_pl: Polski (\`pl\`)\n:flag_nl: Nederlands (\`nl\`)\n:flag_se: Svenska (\`sv\`)\n:flag_no: Norsk (\`no\`)\n:flag_dk: Dansk (\`da\`)\n:flag_fi: Suomi (\`fi\`)\n:flag_gr: Ελληνικά (\`el\`)\n:flag_cz: Čeština (\`cs\`)\n:flag_hu: Magyar (\`hu\`)\n:flag_ro: Română (\`ro\`)\n:flag_rs: Српски (\`sr\`)\n:flag_hr: Hrvatski (\`hr\`)\n:flag_bg: Български (\`bg\`)\n:flag_ua: Українська (\`uk\`)`,
        success: () => `${emojis.success} | :flag_rs: Језик сервера је сада српски!`
    },

    graph: {
        title: (server, days) => `Придружено на ${server} у последњих ${days} дана`,
        content: (total, percent, from, to) => `**${total}** чланова (односно **${percent}%** сервера) је придружено серверу од ${from} до ${to}:`,
        invalid: () => `Морате навести важећи број дана (већи од 1 и мањи од 1000) да прикажете!`,
        months: () =>[
            "Јан",
            "Феб",
            "Мар",
            "Апр",
            "Мај",
            "Јун",
            "Јул",
            "Авг",
            "Сеп",
            "Окт",
            "Нов",
            "Дец"
        ],
        
    },

    website: {
        doc: {
            variables: () => `https://invite-count.xyz/configuration/variables`
        },
        utils: {
            members: () => `чланови`
        },
        conf: {
            title: () => `Конфигурација`
        },
        selector: {
            title: () => `Бирач`,
            manage: () => `Управљање`,
            no: {
                title: () => `Нема сервера`,
                content: () => `Сервер није пронађен. Молимо проверите да сте пријављени са правилним налогом.`
            }
        },
        help: {
            title: () => `Помоћ`,
            doc: () => `Документација`,
            support: () => `Сервер подршке`
        },
        forms: {
            buttons: {
                enable: () => `Омогући поруке`,
                disable: () => `Онемогући поруке`,
                update: () => `Ажурирај поруке`
            },
            basic: {
                title: () => `Основна конфигурација`,
                language: () => `Језик`,
                prefix: () => `Префикс`,
                update: () => `Ажурирање`
            },
            join: {
                title: () => `Поруке придруживања`,
                message: {
                    title: () => `Порука`,
                    default: () => `{user} се придружио серверу! Позван од стране **{inviter.tag}** ({inviter.invites} позива).`
                },
                channel: {
                    title: () => `Канал`
                },
            },
            leave: {
                title: () => `Поруке напуштања`,
                message: {
                    title: () => `Порука`,
                    default: () => `{user.username} је напустио сервер. Позван од стране **{inviter.tag}** ({inviter.invites} позива).`
                },
                channel: {
                    title: () => `Канал`
                }
            },
            joinDM: {
                title: () => `DM поруке придруживања`,
                premium: () => `Ова функција је доступна за премијум и партнерске сервере.`,
                message: {
                    title: () => `Порука`,
                    default: () => `Добро дошли {user}! Придружили сте се **{server}**! Позван од стране **{inviter.tag}**. Не заборавите да прочитате правила сервера!`,
                }
            }
        }
    },

    removeinvites: {
        loading: {
            all: (prefix) => `${emojis.loading} | Процес уклањања позива сервера је почео... Можете их вратити командом \`${prefix}restore-invites\`!`,
            member: (prefix, member) => `${emojis.loading} | Процес уклањања позива од **${member.user.tag}}** је почео... Можете их вратити командом \`${prefix}restore-invites ${member.user.tag}\`!`
        },
        title: () => `☄️ Позиви ресетовани`,
        titles: {
            all: (prefix) => `${emojis.success} | Позиви сервера су ресетовани! Можете их вратити командом \`${prefix}restore-invites\`!`,
            member: (prefix, member) => `${emojis.success} | Позиви од **${member.user.tag}}** су ресетовани! Можете их вратити командом \`${prefix}restore-invites ${member.user.tag}\`!`
        }
    },

    restoreinvites: {
        confirmations: {
            all: (prefix, memberCount) => `${emojis.warn} | Да ли сте сигурни да желите да вратите позиве сервера? Сви чланови ће добити позиве пре последње команде \`${prefix}remove-invites\` (или 0 ако команда никад није покренута).\n\n:information_source: **Резиме позива**:\nБиће враћено, укупно: **${memberCount.invites}** нормалних, **${memberCount.bonus}** бонус, **${memberCount.leaves}** одласка, **${memberCount.fake}** лажних.\n\n${emojis.success} Унесите \`-confirm\` да потврдите.\n${emojis.error} Унесите \`cancel\` да отказате.`,
            member: (prefix, member) => `${emojis.warn} | Да ли сте сигурни да желите да вратите позиве од **${member.user.tag}}**? Добићете позиве пре последње команде \`${prefix}remove-invites\` (или 0 ако команда никад није покренута).\n\n:information_source: **Резиме позива**:\nБиће враћено: **${member.data.old_invites}** нормалних, **${member.data.old_bonus}** бонус, **${member.data.old_leaves}** одласка, **${member.data.old_fake}** лажних.\n\n${emojis.success} Унесите \`-confirm\` да потврдите.\n${emojis.error} Унесите \`cancel\` да отказате.`,
            cancelled: () => `${emojis.error} Отказано.`
        },
        loading: {
            all: () => `${emojis.loading} | Процес враћања позива сервера је почео....`,
            member: (member) => `${emojis.loading} | Процес враћања позива од **${member.user.tag}}** је почео...`
        },
        title: () => `☄️ Позиви враћени`,
        titles: {
            all: () => `${emojis.success} | Позиви сервера су враћени!`,
            member: (member) => `${emojis.success} | Позиви од **${member.user.tag}}** су враћени!`
        }
    },

    syncinvites: {
        no: () => `${emojis.error} | Нема позива за синхронизацију.`,
        confirmations: {
            all: (inviteCount) => `${emojis.warn} | Да ли сте сигурни да желите да синхронизујете позиве сервера?\n\n:information_source: **Резиме позива**:\n**${Math.round(inviteCount)}** нормалних позива ће бити враћено.\n\n${emojis.success} Унесите \`-confirm\` да потврдите.\n${emojis.error} Унесите \`cancel\` да отказате.`,
            cancelled: () => `${emojis.error} Отказано.`
        },
        title: () => `☄️ Позиви синхронизовани`,
        titles: {
            all: () => `${emojis.success} | Позиви сервера су синхронизовани!`
        }
    },

    add: {
        content: (id) => `Можете ме додати на свој сервер кликнувши [овде](https://discordapp.com/oauth2/authorize?client_id=${id}&scope=bot&permissions=2146958847).`,
        requested: (username) => `Тражио ${username}`
    },

    support: {
        content: (id) => `Можете се придружити нашем серверу подршке кликнувши [овде](https://discord.gg/f7f2P2q).`,
        requested: (username) => `Тражио ${username}`
    }

};
