const { emojis, discord } = require("../config");

module.exports = {

    locale: "uk_UA",

    utils: {
        prefix: (prefix) => `Мій поточний префікс \`${prefix}\`\nВикористовуйте \`${prefix}help\` для додаткової інформації.`,
        viewConf: () => `[Переглянути конфігурацію на інформаційній панелі](https://invite-count.xyz)`,
        conf: {
            title: () => `Переглянути конфігурацію на інформаційній панелі`,
            content: () => `[або на інформаційній панелі](https://invite-count.xyz)`
        },
        specialMessages: {
            join: {
                oauth2: (user) => `${user} приєднався до сервера через OAuth.`,
                
                vanity: (user) => `${user} приєднався до сервера через посилання discord.gg, встановлене власником сервера.`,
                unknown: (user) => `Не можу зрозуміти, як ${user} приєднався до сервера.`,
                perm: (user) => `${emojis.error} | Мені потрібні дозволи на управління сервером, щоб знати, хто запросив ${user}.`
            },
            leave: {
                oauth2: (user) => `${user} залишив сервер, приєднався через OAuth.`,
                vanity: (user) => `${user} залишив сервер, приєднався через посилання discord.gg, встановлене власником сервера.`,
                unknown: (user) => `${user} залишив сервер, але я не можу зрозуміти, як він приєднався.`
            }
        }
    },

    errors: {
        missingPerms: (neededPermissions) => `__**${emojis.error} Відсутні дозволи**__\n\nМені потрібні такі дозволи, щоб ця команда працювала правильно: ${neededPermissions.map((p) => "`"+p+"`").join(", ")}`,
        disabled: () => `${emojis.error} | Ця команда в даний час вимкнена!`,
        permLevel: (name) => `${emojis.error} | Ця команда вимагає рівня дозволу: \`${name}\`!`,
        sendPerm: () => `${emojis.error} | У мене немає дозволу відправляти повідомлення на цей канал.`,
        missingAdmin: () => `${emojis.error} | Мені потрібен дозвіл \`Керування сервером\` для виконання цієї дії`
    },
    glogs: {
        err: () => `<:error:851490719934840872> | Поточний канал вже це канал!`,
        success: () => `<:succes:851491428563812382> | Канал журналу успішно встановлено.`
    },
    glist: {
        title: () => `🎁 Список розіграшів`,
        description: (prefix) => `Використовуйте \`${prefix}gstart\` для запуску розіграшу. Показані лише незавершені розіграші`,
        fields: {
            name: () => `> Список`,
            message: (gs) => `${gs.map(ginfos=>`<:channel:851482936787730472> [${ginfos.prize}](${ginfos.messageURL}) : Закінчується ${ginfos.endAt}`).join("\n")} `
        },
        err: () => `<:error:851490719934840872> | На цьому сервері немає незавершених розіграшів`,

    },
    help: {
        title: () => `ℹ Сторінка допомоги InviteCount`,
        description: (guildName, prefix) => `InviteCount дозволяє вам керувати членами сервера, відстежуючи запрошення.\n\n**Документація** доступна [тут](https://docs.invite-count.xyz/).`,
        moderation: {
            title: () => `🛡️ **Модерація**`,
            content: (prefix) => "> `ban`, `kick`, `unban`"},
        admin: {
            title: () => `⚙️ **Адміністрація**`,
            content: (prefix) => "> `addbonus`, `removebonus`, `sync-invites`, `removeinvites`, `restoreinvites`, `setprefix`, `setlang`, `config`"},
        joinDM: {
            title: () => `💻 **Загальне**`,
            content: (prefix) => "> `infos`, `add`, `membercount`, `userinfo`, `support`, `credits`, `invites`, `leaderboard`"},
        join: {
            title: () => `:tools: **Конфігурація**`,
            content: (prefix) => "> `configjoin`, `setjoin`, `testjoin`, `configleave`, `setleave`, `testleave`, `configdm`, `setdm`, `testdm`"},
        leave: {
            title: () => `:envelope: Повідомлення про вихід`,
            content: (prefix) => "`configleave`, `setleave`, `testleave`"},
        giveaway: {
            title: () => `🎁 **Розіграші**`,
            content: (prefix) => "> `gstart`, `gend`, `glist`, `glogs`, `greroll`"},
        invites: {
            title: () => `:wave: Запрошення`,
            content: (prefix) => "`invite`, `leaderboard`"},
        manageInvite: {
            title: () => `💠 Інструменти`,
            content: (prefix) => "`membercount`, `userinfo`, `botinfos`, `ping`, `creators`, `support`, `credits`, `add`"},
        tip: (prefix) => `🔗 Посилання :`,
        links: (clientID) => `[Додайте мене](https://discordapp.com/api/oauth2/authorize?client_id=${clientID}&permissions=8&scope=bot) ● [Веб-сайт](https://invite-count.xyz) ● [Сервер підтримки](${discord}) ● [Голосуйте за мене](https://discord.boats/bot/${clientID}/vote)`
    },

    infos: {
        title: () => `**InviteCount**`,
        content: () => `InviteCount дозволяє вам керувати членами сервера, відстежуючи запрошення.`,

        dev: {
            title: () => `**Інформація**`,
            content: (uptime) => `<:arrow:766358167382523944> **Розробники:** Npg, Alex, Alboom\n <:arrow:766358167382523944> **Бібліотека:** [discord.js v14.14.1](https://discord.js.org/#/)\n <:arrow:766358167382523944> **Час роботи** ${uptime}\n <:arrow:766358167382523944> **Дата створення:** 12 травня 2019 р.`
        },
        statistics: {
            title: () => `**Статистика**`,
            content: (guilds, users, channels, ping, ram, shardID) => `<:arrow:766358167382523944> **Сервери:** ${guilds}\n<:arrow:766358167382523944> **Користувачі**: ${channels}\n<:arrow:766358167382523944> **Канали:** ${users}`
        },
        link: {
            title: () => `**Посилання**`,
            content: () => `<:arrow:766358167382523944> **Сервер підтримки:** [Натисніть](${discord})\n<:arrow:766358167382523944> **Запрошення:** [Натисніть](https://discordapp.com/api/oauth2/authorize?client_id=577236734245470228&permissions=8&scope=bot)`
        }
    },

    credits: {
        title: () => `**InviteCount**`,
        content: () => `InviteCount дозволяє вам керувати членами сервера, відстежуючи запрошення.`,

        dev: {
            title: () => `**Розробники :**`,
            content: (uptime) => `[Npg](https://github.com/ThisDudeBoy)\n[Alex](https://discord.com)\n[Alboom](https://discord.com)`
        },
        statistics: {
            title: () => `**Вдохновлено :**`,
            content: (guilds, users, channels, ping, ram, shardID) => `[ManageInvite](https://github.com/ManageInvite/ManageInvite)\n[InviteManager](https://github.com/SideProjectGuys/invite-manager-bot)`
        },
        link: {
            title: () => `**Спеціальна подяка :**`,
            content: () => `⭐ **Androz** за допомогу з ManageInvite!\n🎁 **Pauldb09** за систему розіграшу\n👨‍🏭 Весь комунікаційний відділ & Перекладачі`
        }
    },

    invite: {
        description: (member, memberData, isYou, nextRank, role) => `${isYou ? `У вас є` : `**${member.user.username}** має`} **${memberData.invites + memberData.bonus - memberData.leaves - memberData.fake}** запрошень! (**${memberData.invites}** звичайних, **${memberData.bonus}** бонус, **${memberData.fake > 0 ? `-${memberData.fake}` : `${memberData.fake}`}** фальшивих, **${memberData.leaves > 0 ? `-${memberData.leaves}` : `${memberData.leaves}`}** виходів)${nextRank ? `\nВам потрібно **${Math.round(nextRank.inviteCount - (memberData.invites + memberData.bonus - memberData.leaves - memberData.fake))}** ще запрошень, щоб досягти наступного рангу: **${role}**!` : ""}`
    },

    inviter: {
        description: (member, inviterName) => `**${member.user.username}** was invited by **${inviterName}**`,
        unknown: () => `Unknown`,
        notFound: () => `Inviter not found (user may have been deleted)`
    },
    leaderboard: {
        cleared: () => `${emojis.success} | Таблиця лідерів видалена!`,
        user: (user, member, lb) => `${lb} **${user.username}** - **${member.calculatedInvites}** запрошень (**${member.invites}** звичайних, **${member.bonus}** бонус, **${member.fake > 0 ? `-${member.fake}` : `${member.fake}`}** фальшивих, **${member.leaves > 0 ? `-${member.leaves}` : `${member.leaves}`}** виходів)`,
        prompt: () => `{{user}}, на яку сторінку ви хочете перейти? Введіть \`cancel\` або \`0\` для скасування.`,
        title: () => `Таблиця лідерів запрошень`,
        empty: {
            title: () => `😕 Запрошення не знайдено`,
            content: () => `Почніть запрошувати людей і ви з'явитеся на цій сторінці!`
        }
    },

    userinfo: {
        title: (user) => `${user.tag} обліковий запис (${user.id})`,
        fields: {
            createdAt: {
                title: () => `<:createdAt:741247823269593118> Створення`
            },
            bot: {
                title: () => `<:maestro_robot:749985600110723184> Бот`,
                content: (user) => user.bot ? "Так" : "Ні"
            },
            joinedAt: {
                title: () => `<:join:741252065585660014> Приєднався`
            },
            joinWay: {
                title: () => `Спосіб приєднання`,
                oauth: () => `Запрошення OAuth (через discordapp.com).`,
                vanity: () => `Спеціальне запрошення встановлене адміністратором.`,
                unknown: (user) => `Я не можу розібратися, як користувач ${user.username} приєднався до сервера.`,
                invite: (user) => user.tag
            },
            invites: {
                title: () => `✉️ Запрошення`,
                content: (inviteData) => `**${inviteData.invites + inviteData.bonus - inviteData.leaves - inviteData.fake}** запрошень (**${inviteData.invites}** звичайних, **${inviteData.bonus}** бонус, **${inviteData.fake > 0 ? `-${inviteData.fake}` : `${inviteData.fake}`}** фальшивих, **${inviteData.leaves > 0 ? `-${inviteData.leaves}` : `${inviteData.leaves}`}** виходів)`
            },
            joinOrder: {
                title: () => `➡️ Порядок приєднання`,
                content: (previous, next, user) => `${previous ? `**${previous.tag}** > ` : ""}**${user.tag}**${next ? ` > **${next.tag}**` : ""}`
            }
        }
    },

    kick: {
        errors:{
            missingPerms: "<:error:753232040199192657> | Ви повинні мати дозвіл `KICK_MEMBERS`",
            nouser: "<:error:753232040199192657> | Будь ласка, назвіть користувача",
            supperior: "<:error:753232040199192657> | Ви не можете вигнати користувача, який вище вас",
            noperm: "<:error:753232040199192657> | Сталася помилка... Будь ласка, перевірте, чи у мене є дозвіл вигнати цього члена, і спробуйте ще раз!",
            
        },
        description: "<:success:753232040073101363> | Користувач вигнаний.",
        banneddm: (server, moderator, reason) => "Ви були вигнані з **" + server + "** користувачем **" + moderator + "**\n**Причина** : `" + reason + "`" 
    },

    ban: {
        errors:{
            missingPerms: "<:error:753232040199192657> | Ви повинні мати дозвіл `BAN_MEMBERS`",
            nouser: "<:error:753232040199192657> | Будь ласка, назвіть користувача",
            supperior: "<:error:753232040199192657> | Ви не можете заблокувати користувача, який вище вас",
            noperm: "<:error:753232040199192657> | Сталася помилка... Будь ласка, перевірте, чи у мене є дозвіл заблокувати цього члена, і спробуйте ще раз!",
            
        },
        description: "<:success:753232040073101363> | Користувач заблокований.",
        banneddm: (server, moderator, reason) => "Ви були заблоковані на **" + server + "** користувачем **" + moderator + "**\n**Причина** : `" + reason + "`" 
    },

    unban: {
        noid: "<:error:753232040199192657> | Будь ласка, вкажіть ID для розблокування",
        success: (user) => "<:success:753232040073101363> | " + user + " успішно розблокований",
        noban: "<:error:753232040199192657> | Цей користувач не заблокований"
    },

    membercount: {
        title: (guildName) => `Кількість членів ${guildName}`,
        description: (guild) => `
        Усього **${guild.members.cache.size}** членів (**${guild.members.cache.filter((m) => !m.user.bot).size}** людей і **${guild.members.cache.filter((m) => m.user.bot).size}** ботів)

        ➔ ${emojis.dnd} | ${guild.members.cache.filter((m) => m.presence.status === "dnd"  && !m.user.bot).size} членів (не турбувати)
        ➔ ${emojis.online} | ${guild.members.cache.filter((m) => m.presence.status === "online" && !m.user.bot).size} членів (онлайн)
        ➔ ${emojis.idle} | ${guild.members.cache.filter((m) => m.presence.status === "idle" && !m.user.bot).size} членів (неактивна)
        ➔ ${emojis.offline} | ${guild.members.cache.filter((m) => m.presence.status === "offline" && !m.user.bot).size} членів (офлайн)`
    },

    addbonus: {
        errors: {
            bonus: {
                missing: (prefix) => `${emojis.error} | Ви повинні вказати кількість бонусних запрошень для додавання. (Синтаксис: ${prefix}addbonus число @член) **Ви повинні запросити реальну людину, щоб отримати нагороду**`,
                incorrect: (prefix) => `${emojis.error} | Ви повинні вказати дійсну кількість бонусних запрошень для додавання. (Синтаксис: ${prefix}addbonus число @член)`
            },
            member: {
                missing: (prefix) => `${emojis.error} | Ви повинні назвати члена для додавання бонусних запрошень. (Синтаксис: ${prefix}addbonus число @член)`
            }
        },
        title: () => `📥 Бонусні запрошення додані`,
        field: (prefix, member) => `Введіть \`${prefix}invites ${member.user.tag}\` щоб побачити нову кількість запрошень для **${member.user.username}**!`
    },

    removebonus: {
        errors: {
            bonus: {
                missing: (prefix) => `${emojis.error} | Ви повинні вказати кількість бонусних запрошень для видалення. (Синтаксис: ${prefix}removebonus число @член)`,
                incorrect: (prefix) => `${emojis.error} | Ви повинні вказати дійсну кількість бонусних запрошень для видалення. (Синтаксис: ${prefix}removebonus число @член)`
            },
            member: {
                missing: (prefix) => `${emojis.error} | Ви повинні назвати члена для видалення бонусних запрошень. (Синтаксис: ${prefix}removebonus число @член)`
            }
        },
        title: () => `📥 Бонусні запрошення видалені`,
        field: (prefix, member) => `Введіть \`${prefix}invites ${member.user.tag}\` щоб побачити нову кількість запрошень для **${member.user.username}**!`
    },

    setdmjoin: {
        on: () => `**${emojis.success} | Система приєднання DM тепер __УВІМКНЕНА__!**`,
        off: () => `**${emojis.success} | Система приєднання DM тепер __ВИМКНЕНА__!**`
    },

    setjoin: {
        on: () => `**${emojis.success} | Система приєднання тепер __УВІМКНЕНА__!**`,
        off: () => `**${emojis.success} | Система приєднання тепер __ВИМКНЕНА__!**`
    },

    setleave: {
        on: () => `**${emojis.success} | Система виходу тепер __УВІМКНЕНА__!**`,
        off: () => `**${emojis.success} | Система виходу тепер __ВИМКНЕНА__!**`
    },

    setprefix: {
        missing: () => `${emojis.error} | Ви повинні вказати префікс!`,
        success: () => `${emojis.success} | Префікс сервера успішно оновлено!`
    },

    testdmjoin: {
        title: () => `:wrench: Система приєднання DM :`,
        description: () => `Якщо це не працює, перевірте дозволи бота або приєднайтеся до [сервера підтримки](${discord})`,
        fields: {
            enabled: () => `> Увімкнено:`,
            message: () => `> Повідомлення:`
        },
        enabled: (prefix) => `${emojis.success} Повідомлення про приєднання DM увімкнені. Вимкніть за допомогою \`${prefix}setdmjoin\`.`,
        disabled: (prefix) =>  `${emojis.error} Повідомлення про приєднання DM вимкнені. Увімкніть за допомогою \`${prefix}setdmjoin\`.`,
        notDefineds: {
            message: (prefix) => `Повідомлення не визначено. Встановіть за допомогою \`${prefix}configdm\`!`
        }
    },

    testjoin: {
        title: () => `:wrench: Система приєднання :`,
        description: () => `Якщо це не працює, перевірте дозволи бота або приєднайтеся до [сервера підтримки](${discord})`,
        fields: {
            enabled: () => `> Увімкнено:`,
            channel: () => `> Канал:`,
            message: () => `> Повідомлення:`
        },
        enabled: (prefix) => `${emojis.success} Повідомлення про приєднання увімкнені. Вимкніть за допомогою \`${prefix}setjoin\`.`,
        disabled: (prefix) =>  `${emojis.error} Повідомлення про приєднання вимкнені. Увімкніть за допомогою \`${prefix}setjoin\`.`,
        notDefineds: {
            message: (prefix) => `Повідомлення не визначено. Встановіть за допомогою \`${prefix}configjoin\`!`,
            channel: (prefix) => `Канал не визначено. Встановіть за допомогою \`${prefix}configjoin\`!`
        }
    },

    testleave: {
        title: () => `:wrench: Система виходу :`,
        description: () => `Якщо це не працює, перевірте дозволи бота або приєднайтеся до [сервера підтримки](${discord})`,
        fields: {
            enabled: () => `> Увімкнено:`,
            channel: () => `> Канал:`,
            message: () => `> Повідомлення:`
        },
        enabled: (prefix) => `${emojis.success} Повідомлення про вихід увімкнені. Вимкніть за допомогою \`${prefix}setleave\`.`,
        disabled: (prefix) =>  `${emojis.error} Повідомлення про вихід вимкнені. Увімкніть за допомогою \`${prefix}setleave\`.`,
        notDefineds: {
            message: (prefix) => `Повідомлення не визначено. Встановіть за допомогою \`${prefix}configleave\`!`,
            channel: (prefix) => `Канал не визначено. Встановіть за допомогою \`${prefix}configleave\`!`
        }
    },

    config: {
        title: (guildName) => `Конфігурація ${guildName}`,
        join: {
            title: (enabled) => `${(enabled ? emojis.success : emojis.error)} Повідомлення про приєднання`,
            content: (guild, data) => `
            > Увімкнено: ${data.guild.join.enabled ? "**так**" : "**ні**"}
            > Повідомлення: ${data.guild.join.message ? "**встановлено**" : "**не встановлено**."}
            > Канал: ${!data.guild.join.channel ? "**не встановлено**" : (guild.channels.cache.get(data.guild.join.channel) ? "**встановлено**" : "**канал не знайдено**")}`
        },
        leave: {
            title: (enabled) => `${(enabled ? emojis.success : emojis.error)} Повідомлення про вихід`,
            content: (guild, data) => `
            > Увімкнено: ${data.guild.leave.enabled ? "**так**" : "**ні**"}
            > Повідомлення: ${data.guild.leave.message ? "**встановлено**" : "**не встановлено**."}
            > Канал: ${!data.guild.leave.channel ? "**не встановлено**" : (guild.channels.cache.get(data.guild.leave.channel) ? "**встановлено**" : "**канал не знайдено**")}`
        },
        joinDM: {
            title: (enabled) => `${(enabled ? emojis.success : emojis.error)} Повідомлення про приєднання DM`,
            content: (guild, data) => `
            > Увімкнено: ${data.guild.joinDM.enabled ? "**так**" : "**ні**"}
            > Повідомлення: ${data.guild.joinDM.message ? "**встановлено**" : "**не встановлено**."}`
        },
    },

    joinDM: {
        premium: (username) => `:crown: | Привіт, **${username}**! Ця функція доступна лише для преміум та партнерських серверів. Отримайте преміум: **скоро** !`
    },

    antispam: {
        cooldown: (username) => `Сповільніться! Будь ласка, чекайте 5 секунд і спробуйте ще раз!`
    },

    configdmjoin: {
        disable: (prefix) => `Введіть \`${prefix}setdmjoin\` щоб вимкнути повідомлення про приєднання DM.`,
        instruct: (str) => `
__**Додаткова інформація**__
\`\`\`
{user} : Згадування члена, який приєднався до сервера.
{user.name} : Ім'я члена, який приєднався до сервера.
{user.tag} : Тег члена, який приєднався до сервера.
{user.createdat} : Вік облікового запису члена.

{guild} : Назва сервера.
{guild.count} : Поточна кількість членів на вашому сервері.

{inviter} : Згадування того, хто запросив.
{inviter.name} : Ім'я того, хто запросив.
{inviter.tag} : Тег того, хто запросив.
{inviter.invites} : Загальна кількість запрошень від того, хто запросив.

{invite.code} : Використаний код запрошення.
{invite.url} : Використана URL запрошення.
{invite.uses} : Скільки разів був використаний код запрошення.
\`\`\`
Введіть \`cancel\` для скасування. ${str}


:pencil: **| Тепер введіть повідомлення про приєднання DM... :pencil2:**`,
        cancelled: () => `:x: Скасовано.`,
        success: () => `✅ **| Готово..**`,
        title: () => `**Повідомлення про приєднання DM встановлено**`,
        fields: {
            message: () => `Повідомлення:`,
            testIt: () => `Тест:`,
            cmd: (prefix) => `Використовуйте \`${prefix}testdmjoin\` для тестування нового повідомлення.`
        },

    },

    configjoin: {
        longmessage: () => `<:error:753232040199192657> | Ваше повідомлення повинно бути менше 850 символів.`, 
        disable: (prefix) => `Введіть \`${prefix}setjoin\` щоб вимкнути повідомлення про приєднання.`,
        instructs: {
            message: (str) => `
__**Додаткова інформація**__
\`\`\`
{user} : Згадування члена, який приєднався до сервера.
{user.name} : Ім'я члена, який приєднався до сервера.
{user.tag} : Тег члена, який приєднався до сервера.
{user.createdat} : Вік облікового запису члена.

{guild} : Назва сервера.
{guild.count} : Поточна кількість членів на вашому сервері.

{inviter} : Згадування того, хто запросив.
{inviter.name} : Ім'я того, хто запросив.
{inviter.tag} : Тег того, хто запросив.
{inviter.invites} : Загальна кількість запрошень від того, хто запросив.

{invite.code} : Використаний код запрошення.
{invite.url} : Використана URL запрошення.
{invite.uses} : Скільки разів був використаний код запрошення.
\`\`\`
Введіть \`cancel\` для скасування. ${str}


:pencil: **| Тепер введіть повідомлення про приєднання... :pencil2:**`,
            channel: () => `:scroll: **| Тепер назвіть канал... :pencil2:**`
        },
        cancelled: () => `:x: Скасовано.`,
        success: () => `✅ **| Готово..**`,
        title: () => `**Повідомлення про приєднання встановлено**`,
        fields: {
            message: () => `Повідомлення:`,
            channel: () => `Канал:`,
            testIt: () => `Тест:`,
            cmd: (prefix) => `Використовуйте \`${prefix}testjoin\` для тестування нового повідомлення.`
        },
        errors: {
            channelNotFound: (channel) => `${emojis.error} | Канал не знайдено для \`${channel}\``
        }
    },

    configleave: {
        disable: (prefix) => `Введіть \`${prefix}setleave\` щоб вимкнути повідомлення про вихід.`,
        instructs: {
            message: (str) => `
__**Додаткова інформація**__
\`\`\`
{user} : Згадування члена, який залишив сервер.
{user.name} : Ім'я члена, який залишив сервер.
{user.tag} : Тег члена, який залишив сервер.
{user.createdat} : Вік облікового запису члена.

{guild} : Назва сервера.
{guild.count} : Поточна кількість членів на вашому сервері.

{inviter} : Згадування того, хто запросив.
{inviter.name} : Ім'я того, хто запросив.
{inviter.tag} : Тег того, хто запросив.
{inviter.invites} : Загальна кількість запрошень від того, хто запросив.

{invite.code} : Використаний код запрошення.
{invite.url} : Використана URL запрошення.
{invite.uses} : Скільки разів був використаний код запрошення.
\`\`\`
Введіть \`cancel\` для скасування. ${str}


:pencil: **| Тепер введіть повідомлення про вихід... :pencil2:**`,
            channel: () => `:scroll: **| Тепер назвіть канал... :pencil2:**`
        },
        cancelled: () => `:x: Скасовано.`,
        success: () => `✅ **| Готово..**`,
        title: () => `**Повідомлення про вихід встановлено**`,
        fields: {
            message: () => `Повідомлення:`,
            channel: () => `Канал:`,
            testIt: () => `Тест:`,
            cmd: (prefix) => `Використовуйте \`${prefix}testleave\` для тестування нового повідомлення`
        },
        errors: {
            channelNotFound: (channel) => `${emojis.error} | Канал не знайдено для \`${channel}\``
        }
    },

    setlang: {
        invalid: () => `${emojis.error} | Ви повинні вказати дійсну мову!\n\n:flag_fr: Français (\`fr\`)\n:flag_gb: English (\`en\`)\n:flag_tr: Türkçe (\`tr\`)\n:flag_ru: Русский (\`ru\`)\n:flag_jp: 日本語 (\`jp\`)\n:flag_in: हिंदी (\`hi\`)\n:flag_pt: Português (\`pt\`)\n:flag_br: Português Brasileiro (\`br\`)\n:flag_es: Español (\`es\`)\n:flag_de: Deutsch (\`de\`)\n:flag_it: Italiano (\`it\`)\n:flag_pl: Polski (\`pl\`)\n:flag_nl: Nederlands (\`nl\`)\n:flag_se: Svenska (\`sv\`)\n:flag_no: Norsk (\`no\`)\n:flag_dk: Dansk (\`da\`)\n:flag_fi: Suomi (\`fi\`)\n:flag_gr: Ελληνικά (\`el\`)\n:flag_cz: Čeština (\`cs\`)\n:flag_hu: Magyar (\`hu\`)\n:flag_ro: Română (\`ro\`)\n:flag_rs: Српски (\`sr\`)\n:flag_hr: Hrvatski (\`hr\`)\n:flag_bg: Български (\`bg\`)\n:flag_ua: Українська (\`uk\`)`,
        success: () => `${emojis.success} | :flag_ua: Мова сервера тепер українська!`
    },

    graph: {
        title: (server, days) => `Приєднано до ${server} за останні ${days} днів`,
        content: (total, percent, from, to) => `**${total}** членів (тобто **${percent}%** сервера) приєдналися до сервера від ${from} до ${to}:`,
        invalid: () => `Ви повинні вказати дійсну кількість днів (більше 1 і менше 1000) для відображення!`,
        months: () =>[
            "Січ",
            "Лют",
            "Бер",
            "Кві",
            "Тра",
            "Чер",
            "Липня",
            "Серп",
            "Вересня",
            "Жовтня",
            "Листо",
            "Груд"
        ],
        
    },

    website: {
        doc: {
            variables: () => `https://invite-count.xyz/configuration/variables`
        },
        utils: {
            members: () => `членів`
        },
        conf: {
            title: () => `Конфігурація`
        },
        selector: {
            title: () => `Селектор`,
            manage: () => `Керування`,
            no: {
                title: () => `Немає серверів`,
                content: () => `Сервер не знайдено. Будь ласка, перевірте, що ви увійшли з правильним обліковим записом.`
            }
        },
        help: {
            title: () => `Довідка`,
            doc: () => `Документація`,
            support: () => `Сервер підтримки`
        },
        forms: {
            buttons: {
                enable: () => `Увімкнути повідомлення`,
                disable: () => `Вимкнути повідомлення`,
                update: () => `Оновити повідомлення`
            },
            basic: {
                title: () => `Базова конфігурація`,
                language: () => `Мова`,
                prefix: () => `Префікс`,
                update: () => `Оновлення`
            },
            join: {
                title: () => `Повідомлення про приєднання`,
                message: {
                    title: () => `Повідомлення`,
                    default: () => `{user} приєднався до сервера! Запрошен **{inviter.tag}** ({inviter.invites} запрошень).`
                },
                channel: {
                    title: () => `Канал`
                },
            },
            leave: {
                title: () => `Повідомлення про вихід`,
                message: {
                    title: () => `Повідомлення`,
                    default: () => `{user.username} залишив сервер. Запрошен **{inviter.tag}** ({inviter.invites} запрошень).`
                },
                channel: {
                    title: () => `Канал`
                }
            },
            joinDM: {
                title: () => `Повідомлення про приєднання DM`,
                premium: () => `Ця функція доступна для преміум та партнерських серверів.`,
                message: {
                    title: () => `Повідомлення`,
                    default: () => `Ласкаво просимо {user}! Ви приєдналися до **{server}**! Запрошен **{inviter.tag}**. Не забудьте прочитати правила сервера!`,
                }
            }
        }
    },

    removeinvites: {
        loading: {
            all: (prefix) => `${emojis.loading} | Процес видалення запрошень сервера розпочатий... Ви можете їх восстановити за допомогою команди \`${prefix}restore-invites\`!`,
            member: (prefix, member) => `${emojis.loading} | Процес видалення запрошень **${member.user.tag}}** розпочатий... Ви можете їх восстановити за допомогою команди \`${prefix}restore-invites ${member.user.tag}\`!`
        },
        title: () => `☄️ Запрошення скинуті`,
        titles: {
            all: (prefix) => `${emojis.success} | Запрошення сервера були скинуті! Ви можете їх восстановити за допомогою команди \`${prefix}restore-invites\`!`,
            member: (prefix, member) => `${emojis.success} | Запрошення **${member.user.tag}}** були скинуті! Ви можете їх восстановити за допомогою команди \`${prefix}restore-invites ${member.user.tag}\`!`
        }
    },

    restoreinvites: {
        confirmations: {
            all: (prefix, memberCount) => `${emojis.warn} | Ви впевнені, що хочете восстановити запрошення сервера? Усі члени отримають запрошення до останнього запуску команди \`${prefix}remove-invites\` (або 0, якщо команда ніколи не запускалася).\n\n:information_source: **Резюме запрошень**:\nБудуть восстановлені, усього: **${memberCount.invites}** звичайних, **${memberCount.bonus}** бонус, **${memberCount.leaves}** виходів, **${memberCount.fake}** фальшивих.\n\n${emojis.success} Введіть \`-confirm\` для підтвердження.\n${emojis.error} Введіть \`cancel\` для скасування.`,
            member: (prefix, member) => `${emojis.warn} | Ви впевнені, що хочете восстановити запрошення **${member.user.tag}}**? Ви отримаєте запрошення до останнього запуску команди \`${prefix}remove-invites\` (або 0, якщо команда ніколи не запускалася).\n\n:information_source: **Резюме запрошень**:\nБудуть восстановлені: **${member.data.old_invites}** звичайних, **${member.data.old_bonus}** бонус, **${member.data.old_leaves}** виходів, **${member.data.old_fake}** фальшивих.\n\n${emojis.success} Введіть \`-confirm\` для підтвердження.\n${emojis.error} Введіть \`cancel\` для скасування.`,
            cancelled: () => `${emojis.error} Скасовано.`
        },
        loading: {
            all: () => `${emojis.loading} | Процес восстановлення запрошень сервера розпочатий....`,
            member: (member) => `${emojis.loading} | Процес восстановлення запрошень **${member.user.tag}}** розпочатий...`
        },
        title: () => `☄️ Запрошення восстановлені`,
        titles: {
            all: () => `${emojis.success} | Запрошення сервера були восстановлені!`,
            member: (member) => `${emojis.success} | Запрошення **${member.user.tag}}** були восстановлені!`
        }
    },

    syncinvites: {
        no: () => `${emojis.error} | Немає запрошень для синхронізації.`,
        confirmations: {
            all: (inviteCount) => `${emojis.warn} | Ви впевнені, що хочете синхронізувати запрошення сервера?\n\n:information_source: **Резюме запрошень**:\n**${Math.round(inviteCount)}** звичайних запрошень буде восстановлено.\n\n${emojis.success} Введіть \`-confirm\` для підтвердження.\n${emojis.error} Введіть \`cancel\` для скасування.`,
            cancelled: () => `${emojis.error} Скасовано.`
        },
        title: () => `☄️ Запрошення синхронізовані`,
        titles: {
            all: () => `${emojis.success} | Запрошення сервера були синхронізовані!`
        }
    },

    add: {
        content: (id) => `Ви можете додати мене на свій сервер, клацнувши [тут](https://discordapp.com/oauth2/authorize?client_id=${id}&scope=bot&permissions=2146958847).`,
        requested: (username) => `Запит від ${username}`
    },

    support: {
        content: (id) => `Ви можете приєднатися до нашого сервера підтримки, клацнувши [тут](https://discord.gg/f7f2P2q).`,
        requested: (username) => `Запит від ${username}`
    }

};
